[
    {
        "id":0,
        "Description":"Q. What does abutment of the nerve root mean?",
        "Doctor":"Hi. I have gone through your query with diligence and would like you to know that I am here to help you. For further information consult a neurologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/neurologist  ",
        "Patient":"Hi doctor,I am just wondering what is abutting and abutment of the nerve root means in a back issue. Please explain. What treatment is required for annular bulging and tear?"
    },
    {
        "id":1,
        "Description":"Q. Every time I eat spicy food, I poop blood. Why?",
        "Doctor":"Hello. I have gone through your information and test reports (attachment removed to protect patient identity). So, in view of that, there are a couple of things that I can opine upon: Hope that helps. For more information consult a general surgeon online --> https:\/\/icliniq.com.\/ask-a-doctor-online\/general-surgeon  ",
        "Patient":"Hi doctor, I am a 26 year old male. I am 5 feet and 9 inches tall and weigh 255 pounds. When I eat spicy food, I poop blood. Sometimes when I have constipation as well, I poop a little bit of blood. I am really scared that I have colon cancer. I do have diarrhea often. I do not have a family history of colon cancer. I got blood tests done last night. Please find my reports attached."
    },
    {
        "id":2,
        "Description":"Q. Will Nano-Leo give permanent solution for erection problem?",
        "Doctor":"Hi. For further doubts consult a sexologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist  ",
        "Patient":"Hello doctor, I am 48 years old. I am experiencing weak erection and difficulty in sustaining the same. This condition was observed 10 years back. Also, there is premature ejaculation. Other physical ailments that I have are, I am suffering from hypertension and taking Amlopres-L (Amlodipine and Lisinopril) for the last 10 years, high cholesterol and triglycerides. My cholesterol level is 225 and triglyceride is 200 for the last 12 years. I used to do frequent masturbation in early age. I do have erection during morning hours many times, particularly after sound sleep or if I had long walk previous day. I am having Sildenafil 25 mg or 5 mg Cialis, which is effective enough. But, I wish to get rid of tablet support and live natural way. I consulted urologist today and he prescribed me Nano-Leo capsules and Modula 5 mg for 10 days. I wish to have your second opinion on this. Please guide."
    },
    {
        "id":3,
        "Description":"Q. Will Kalarchikai cure multiple ovarian cysts in PCOD?",
        "Doctor":"Hello. I just read your query. See Kalarachi Kai choornam is helpful in amenorrhea. As far as small cysts are concerned they are unmatured eggs which failed to induce menstrual cycle previously, as a result, they got collected in the ovary and they will remain in the ovary. Now, you have got your periods you can start trying for conception. But I advise you to do it under the supervision of a nearby gynecologist because egg size is important while conception and that you can know by ovulation study. Ovulation study is performed under the supervision of a gynecologist. For gall stones, surgical intervention is required generally. Medicine is not of much help.  ",
        "Patient":"Hello doctor, I have multiple small cysts in both ovaries (PCOS). Our family friend suggested me to consume Kalarchikai medicine, powdered mixed with pepper and honey to have it for one mandalam (48 days). I have completed nearly 44 days by consuming one small ball of the mixture every morning and before two weeks I got my periods. Then I had checked whether the cysts were dissolved by having an abdomen scan. But still, small multiple follicules have been seen in it with both ovaries enlarged. Kindly suggest me what I can do further. I got married before one and a half years and I am much worried about my pregnancy. I have gallstones as well."
    },
    {
        "id":4,
        "Description":"Q. I masturbate only by rubbing the tip of the penis. Is it a wrong way?",
        "Doctor":"Hi. For further doubts consult a sexologist online -->https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist   ",
        "Patient":"Hi doctor, During masturbation I just rub the tip of the penis and not the entire penis. Is it a wrong way of doing? I do not get excited during sex and unable to ejaculate. Only, rubbing the tip of the penis gives me excitement. Also, two weeks ago, I have undergone circumcision as my foreskin did not retract. Before circumcision too, I have the same problem. Please help."
    },
    {
        "id":5,
        "Description":"Q. Constipation cause bleeding from external hemorrhoids with abdominal pain. Is it diverticulitis?",
        "Doctor":"Hello. I think you are overthinking about your symptoms. To be conscious is good but to be over conscious may fall in the category of anxiety and is not good. I will advise you to be relaxed. Based on your symptoms, I do not feel anything to be worried of. Considering your age and symptoms of constipation and feeling something more probably pointing towards hemorrhoids or some local pathology. But physical examination and maybe flexible sigmoidoscopy would be appropriate to confirm underlying pathology or maybe online video consultation with gastroenterologist if you are worried about going to the hospital. I will advise you following general measures to follow that will help you. 1) Try to relax. Do not overthink. There is nothing serious we are thinking of. 2) Take fibers. Increase it in the diet in the form of vegetables. Add Ispagol in your diet. 3) Avoid constipation. 4) Take plenty of water. 5) Do regular walk, exercise inside your home if you can not go outside. 6) Do not strain in the restroom. 7) Take a sitz bath daily. Follow me in case you got further queries.  ",
        "Patient":"Hi doctor, I am a 22-year-old female who often suffers constipation to the point where I feel like I get minor external hemorrhoids that often bleed. Again, I have not got doctor verification for this but that is what I think. Recently, I have been experiencing pain around the left side of my stomach. I cannot localize it. Sometimes I feel like it is on my back, sometimes the lateral side, and sometimes the front. It usually happens after I eat or pass a stool but I have a minor sensation of discomfort even when I am just sitting. All of this has been getting a lot worse the past couple of days. I often feel nauseated too. I think I may have diverticulitis, however, I am not sure how common it is for my age. I also feel like I have a small localized swelling on the LUQ that hurts when I press on it. I am not sure what is wrong and I really want to go get some tests done but I do not feel safe going to a hospital with certain circumstances."
    },
    {
        "id":6,
        "Description":"Q. I am 28 years old and my weight is only 48 kg. What should I do to increase my weight?",
        "Doctor":"Hi. How is your eating habits? Your total calorie intake should be around 2200 cal\/day. This will include all three meals with a snack in the evening. You can drink any protein supplements at that time. Include ghee two to three teaspoons a day. Cheese or paneer weekly thrice. Exercise every day for 45 minutes to 1 hour. Simplest is brisk walking. Your appetite will increase with exercises. All fruits and vegetables are allowed. Take milkshakes, lassi, protein supplements after your exercise. All kinds of dals and whole pulses are allowed. Whenever you are eating high protein diet follow that by light food. For example, if you are eating channa for breakfast, eat a light lunch. Gradually increase your intake. If you follow my diet, definitely your immune system will become good. Weight gain will happen slowly. Meditation is good for psychological problems. Concentrate on positive things in life. Do not worry too much about your weight. If your overall health is good, it is a very positive sign for you. Follow up after two weeks.  ",
        "Patient":"Hi doctor, I am 27 years old. My weight is 48 kg, and height is 5.8 feet. I am a pure vegetarian. I need to increase my body weight. I am suffering from psychological problems like anxiety. I am not diabetic, BP is normal. I do not smoke and drink. Please suggest foods to increase weight, immunity, and fertility. Kindly advise."
    },
    {
        "id":7,
        "Description":"Q. I get mild left-sided chest pain with low Hb and vitamin B12 levels. Please help.",
        "Doctor":"Hello. I would like to ask you some more questions, do you have symptoms of acid peptic disease or GERD? Or any burning sensation in the epigastric region, the center of your chest (heartburn). If you do, it could also present as chest pain so I will guide you accordingly. I would also like to rule out any muscular pain, for which I will encourage you to take a muscle relaxant and see if it helps. Take tablet Muscoril (Thiocholchicoside 4 mg) one tablet once a day when you experience pain and let me know in the follow up in a couple of days to see if it relieves the pain. Like you said your Vitamin B12 levels are below normal, it could also be neuropathic pain for which I will only advise vitamin B12 supplements (tablet Methycolbalmine once a day for three months) or B complex supplements. You can also improve these levels with diet. Take diet enriched with beef, liver, and chicken. Fish and shellfish such as trout, salmon, tuna fish, and clams. Fortified breakfast cereal. Low-fat milk, yogurt, cheese, and eggs. Since your Hb is also below the ideal levels, take iron-rich foods which are usually Vitamin B12 rich as well. So I will advise diet modification to incorporate these in your everyday routine or take supplements with iron and Vitamin B12 as well. Because anemia can also present with the said symptoms. Lastly, I will encourage you to reduce weight with exercise and changing your diet and switching to a low-fat diet with the addition of more fruits and vegetables to your diet. Try to start with atleast 30-40 minutes of cardio workout every day and work it up from there according to your stamina and you will see the visible change that you feel. You will feel more active and fresh. Try to bring your BMI (body mass index) as close to the normal range as you can. Because obesity itself can cause countless problems as well. I hope this helps. ECG (electrocardiography). Do not lift heavyweights. Take low fat, high fiber diet. After two days.  ",
        "Patient":"Hello doctor, I am a 39-year-old woman. I have mild pain in the left side of the chest (below the neck and above the breast) and then sensation in the upper back from four days. It comes and goes. Sometimes it goes to the right side of the chest also. I have done my ECG and blood test 6 months ago. ECG and blood sugar were normal. No hypertension but hemoglobin was 10 and Vitamin B 12 was below average. What can I do as in lockdown it is not possible to see the doctor as a person. Please help."
    },
    {
        "id":8,
        "Description":"Q. Loose motion is not controlled with antibiotics and bland diet. What should I do now?",
        "Doctor":"Hello. I cannot see any red flags in your symptoms. More likely nothing to worry. It is the function of your intestines that is triggered by some infection and you are facing overactive intestine. More likely it is a functional problem unless proven otherwise. I will advise you to keep things simple. Quit all medications. You already took a few antibiotics. Please follow these general guidelines: 1) Add fibers in your diet like vegetables and Ispagol husk two spoons daily. 2) Keep yourself well hydrated. 3) Add yogurt in your diet. 4) Eat less. 5) More important is to keep yourself relaxed. The best way of doing is by doing a walk, exercise. Please start tablet Mebeverin 135 mg before breakfast and dinner for eight days. Tablet Rifaxamine 200 mg after breakfast and dinner. Continue probiotics. Please follow me after one week. I hope you should be fine, otherwise, I will advise you on some tests.  ",
        "Patient":"Hello doctor, I am a 39-year-old male. I am 168 cm in height and 68 kg in weight. Since last one month, I have been suffering from intermittent loose motions (yellow colored). There is no vomiting, no fever, or major abdominal pain (except for occasional cramps). Initially, I took a combination of Norfloxacin and Tinidazole for four days, but things did not improve. Thereafter on the prescription of my doctor I took Metronidazole 400 and Dicyclomine 20 mg for a period of 14 days. I also took Lactobacillus tablets for the entire period. During these times I only ate poha, rice, curd, and banana. Also, I took boiled water. It is the fifth day now and I have discontinued the medicines. Despite on such a bland diet (no wheat), I still have at least one to two loose motions in a day. My routine medical tests were done in January this year which was normal. My wife and son also developed loose motion in between for a very brief period. However, they recovered fully within three days. Please advice."
    },
    {
        "id":9,
        "Description":"Q. What should I do to reduce my weight gained due to genetic hypothyroidism?",
        "Doctor":"Hi. You have really done well with the hypothyroidism problem. Your levels are normal with less medications which are very good. As it is genetically induced, it is very difficult to lose weight. My advice to you is, you should focus on maintaining normal levels of TSH (thyroid-stimulating hormone) and try to remain active, having a positive outlook in life. Or else, it will become very difficult to balance your life with the symptoms of hypothyroidism. Even though your weight has not reduced, be very careful in not putting on weight here afterward. Everyday brisk walking for 1 hour. If you have body pain, alternate with exercises and walking. Avoid all kinds of junk foods, processed, bakery products, rich sweets, fatty foods, sodas, alcohol, and smoking. Avoid partying and binge eating. Follow the food timings properly. Have small frequent meals. In between snacks should be strictly fruits or any kind of low-calorie foods. Have unsalted nuts around five daily. It can give a glow to your dry skin. Everyday water intake should be around 1.5-2 liters. You can use flax seeds. Powder it and mix it in your food. It is a fiber which will give you fullness. Use turmeric, fenugreek seeds, or powder every day. It is a good antioxidant and fenugreek helps in reducing cholesterol levels. Include low-fat milk, curd every day. Egg white, lean chicken, or fish can be taken daily in moderation (anyone). Organ meats need to be avoided. Is your menstrual cycle normal? Please get back if you have any other complaints. Follow up after 15 days.  ",
        "Patient":"Hi doctor, I am a 22-year-old female who was diagnosed with hypothyroidism (genetic) when I was 12. Over the past five years, I have become around 50 pounds overweight and all of my attempts to lose have seemed to fail so I have given up, but my weight has stayed the same. There is so much information put there about losing weight with hypothyroidism but it all seems to conflict. I am so unsure as to what type of exercise and diet I should follow as a result but I still would like to lose weight, but most importantly have my body feel better. What can I do? I am currently on Levothyroxine, Buspar, and Benedryl."
    },
    {
        "id":10,
        "Description":"Q. Why do I get semen leakage in a very young age?",
        "Doctor":"Hi. Let me tell you that the symptoms described by you suggest that you have a nightfall problem. The high quality way to deal with dusk is the use of herbal or selfmade remedies. There are no aspect outcomes for such remedy methods. You ought to have yogurt at least two or three bowls a day. Avoid looking at porn as plenty of porn arouses you sexually. So it is recommended now not to watch porn. Sage tea – having two cups of sage tea a day will limit the probabilities of nocturnal emission. Gooseberry – popularly recognized as amla acts as an anti-oxidant and helps in lowering the nightfall. Gradually the moist goals trouble will be solved. Bathing – it is a recommendation to take bathtub earlier than you go to bed. It helps you have a sound sleep. A sound sleep is very vital for averting nightfall. I hope this helps.  ",
        "Patient":"Hi doctor, I am a 13-year-old male and I have had semen leakage for about three months. I think it is from weak nerves because last year, I would masturbate a lot but then I stopped because it was becoming painful and I was embarrassed. Then about three months ago, I watched something inappropriate and I ejaculated without doing anything. Then a week later, I started to have semen leakage every day about three to four times a day. I am just very worried and I just want this to be cured and go away. Also, could this affect my eyes in any way? Please help."
    },
    {
        "id":11,
        "Description":"Q. Should I continue the medicines for PCOS even after my periods get regular?",
        "Doctor":"Hello. If you are having regular periods in terms of flow, duration and regularities and if you have already stopped taking Ginette since March, there is no need to resume its intake immediately unless you need contraception also at the same time or not wanting a pregnancy now. In that case, you need to use an alternative mode of contraception to avoid your pregnancy. Please attach your previous prescriptions blood test and ultrasound scan reports based upon which PCOS was diagnosed. Also, inform your height weight and whether there is excessive hair in the chin, upper lip, chest, and abdomen Follow up with reports again. Also, follow the lifestyle modifications described below. Blood for serum fasting insulin levels. Blood for serum vitamin D3 levels. USG (ultrasound) TVS (transvaginal scan) if not done in the past three months. Continue vitamin D. Avoid junk food spicy and dip fried foods. Low carbohydrates, fat restricted, gluten-free diet is recommended. Regular brisk cardio excercise like walking jogging cycling swimming for at least 30 minutes a day is a must. Take frequent small meals.  ",
        "Patient":"Hello doctor, I was diagnosed with PCOS in January so my gynecologist prescribed me Ginette 35 for six months and Bonemac D3 for one month. But from March my periods are regular without taking medicines but there is sometimes slight pain in my lower abdomen and side abdomen. Should I continue medicines despite having normal and regular periods?"
    },
    {
        "id":12,
        "Description":"Q. I am 16 years old and having 3 degree scoliosis. Will it stop progressing when I grow further?",
        "Doctor":"Hello. Before going into the progress of scoliosis, I would like to make you some clarity about the facts on it. 1) The Cobb angle is a measure of the curvature of the spine in degrees. This helps to determine what type of treatment is necessary. A Cobb angle of 10 degrees is regarded as a minimum angulation to define scoliosis. 2) A scoliosis curve of 10 to 15 degrees normally does not require any treatment except for regular check-ups. 3) If the scoliosis curve is 20 to 40 degrees, the orthopedic doctor will prescribe a back brace help to keep the spine from developing more of a curve. 4) More than 45 degrees need correction surgery keeping many pedicle screw and osteotomy to correct the curve. I hope you go for x ray done of your spine and it will be easy to measure properly about the curvature.  ",
        "Patient":"Hi doctor, I am 16 years old. I just recently discovered that I have scoliosis. I do not know much about it but I will tell you what I know. My scoliosis currently has only a 3-degree curve and I am pretty confident it is a C shaped curve, although I am not sure. What do you think are the chances that my scoliosis will develop into adulthood? Do you think it will stop progressing once I am fully grown?"
    },
    {
        "id":13,
        "Description":"Q. My 2. 5 month old kid has tongue tremors. Is this due to SMA?",
        "Doctor":"Hello,  Welcome to icliniq.com. History noted as above, your 2.5-month-old has developed tongue tremors. Please provide me more detailed history such as preterm or full term, birth weight, normal delivery or LSCS. How is her weight? Is she gaining weight and let me know more about family history or any other in the family suffering from SMA (spinal muscular atrophy). SMA is confirmed only by Genetic testing or by muscle study. There are many types of SMA some of them develop symptoms later in life and a few develop in early life. Keep a watch on her development like head holds muscle tone and power and let me know me know if tongue fasciculation increases and the child becomes more hypotonic.  ",
        "Patient":"Hello doctor, I have a 2.5-month-old who I recently noticed developed a tongue tremor. I looked up online for the causes and found them as SMA. She has great motor control, we were not doing tummy time as often because she did not like it but have increased it and have seen a big improvement. My doctor believes it is benign tongue tremor, unfortunately, we had a telehealth appointment due to COVID so he was unable to see her but he told me not to worry and to keep an eye if things get worse. I am so scared it is SMA, what else should I be looking for?"
    },
    {
        "id":14,
        "Description":"Q. My braces are not activated by power chains and creating gaps. Please help.",
        "Doctor":"Hello. There are different types of power chains that are available for the treatment depending on the interlink space. 1. Short (connects every alternate bracket). 2. Long (connects every third bracket). 3. Closed (connects each bracket). So depending on the stage of your treatment, either of the types can be used which may or may not connect individual brackets. Also, we would require the history of the type of malocclusion you had in the first place as the duration of the treatment varies with the complexity of the malocclusion. Complex malocclusion which require a lot of rotations and closure of gaps may take longer than usual. Also, the density of your alveolar bone and your body's bone remodeling rate affects the duration of final results. So in order to give a definitive diagnosis, we would require your treatment history which includes - 1. Preoperative and post-operative clinic photographs (intraoral and extraoral both). 2. Preoperative dental x-rays (OPG and lateral cephalogram). 3. Treatment history including the types of malocclusion, brackets used, wires used and the movements caused. 4. Oral hygiene maintenance routine that you follow during the braces treatment. Waiting for your reply. Brush twice daily with flouride containing paste. Use of salt water gargles everyday especially after meals.Tongue cleaning on regular basis. A periodic check up with your dentist once every 6 months. A visit to the dentist for oral prophylaxis (teeth cleaning and polishing) once every six months. After providing the required information.  ",
        "Patient":"Hello doctor, Why my ortho does not put brackets in power chains while missing one or two spots? I have straight teeth and I am in the sixth year with braces. I think instead of closing gaps, this is creating gaps. Please help."
    },
    {
        "id":15,
        "Description":"Q. What does abutment of the nerve root mean?",
        "Doctor":"Hi. I have gone through your query with diligence and would like you to know that I am here to help you. For further information consult a neurologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/neurologist  ",
        "Patient":"Hi doctor,I am just wondering what is abutting and abutment of the nerve root means in a back issue. Please explain. What treatment is required for annular bulging and tear?"
    },
    {
        "id":16,
        "Description":"Q. Every time I eat spicy food, I poop blood. Why?",
        "Doctor":"Hello. I have gone through your information and test reports (attachment removed to protect patient identity). So, in view of that, there are a couple of things that I can opine upon: Hope that helps. For more information consult a general surgeon online --> https:\/\/icliniq.com.\/ask-a-doctor-online\/general-surgeon  ",
        "Patient":"Hi doctor, I am a 26 year old male. I am 5 feet and 9 inches tall and weigh 255 pounds. When I eat spicy food, I poop blood. Sometimes when I have constipation as well, I poop a little bit of blood. I am really scared that I have colon cancer. I do have diarrhea often. I do not have a family history of colon cancer. I got blood tests done last night. Please find my reports attached."
    },
    {
        "id":17,
        "Description":"Q. Will Nano-Leo give permanent solution for erection problem?",
        "Doctor":"Hi. For further doubts consult a sexologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist  ",
        "Patient":"Hello doctor, I am 48 years old. I am experiencing weak erection and difficulty in sustaining the same. This condition was observed 10 years back. Also, there is premature ejaculation. Other physical ailments that I have are, I am suffering from hypertension and taking Amlopres-L (Amlodipine and Lisinopril) for the last 10 years, high cholesterol and triglycerides. My cholesterol level is 225 and triglyceride is 200 for the last 12 years. I used to do frequent masturbation in early age. I do have erection during morning hours many times, particularly after sound sleep or if I had long walk previous day. I am having Sildenafil 25 mg or 5 mg Cialis, which is effective enough. But, I wish to get rid of tablet support and live natural way. I consulted urologist today and he prescribed me Nano-Leo capsules and Modula 5 mg for 10 days. I wish to have your second opinion on this. Please guide."
    },
    {
        "id":18,
        "Description":"Q. Will Kalarchikai cure multiple ovarian cysts in PCOD?",
        "Doctor":"Hello. I just read your query. See Kalarachi Kai choornam is helpful in amenorrhea. As far as small cysts are concerned they are unmatured eggs which failed to induce menstrual cycle previously, as a result, they got collected in the ovary and they will remain in the ovary. Now, you have got your periods you can start trying for conception. But I advise you to do it under the supervision of a nearby gynecologist because egg size is important while conception and that you can know by ovulation study. Ovulation study is performed under the supervision of a gynecologist. For gall stones, surgical intervention is required generally. Medicine is not of much help.  ",
        "Patient":"Hello doctor, I have multiple small cysts in both ovaries (PCOS). Our family friend suggested me to consume Kalarchikai medicine, powdered mixed with pepper and honey to have it for one mandalam (48 days). I have completed nearly 44 days by consuming one small ball of the mixture every morning and before two weeks I got my periods. Then I had checked whether the cysts were dissolved by having an abdomen scan. But still, small multiple follicules have been seen in it with both ovaries enlarged. Kindly suggest me what I can do further. I got married before one and a half years and I am much worried about my pregnancy. I have gallstones as well."
    },
    {
        "id":19,
        "Description":"Q. I masturbate only by rubbing the tip of the penis. Is it a wrong way?",
        "Doctor":"Hi. For further doubts consult a sexologist online -->https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist   ",
        "Patient":"Hi doctor, During masturbation I just rub the tip of the penis and not the entire penis. Is it a wrong way of doing? I do not get excited during sex and unable to ejaculate. Only, rubbing the tip of the penis gives me excitement. Also, two weeks ago, I have undergone circumcision as my foreskin did not retract. Before circumcision too, I have the same problem. Please help."
    },
    {
        "id":20,
        "Description":"Q. Constipation cause bleeding from external hemorrhoids with abdominal pain. Is it diverticulitis?",
        "Doctor":"Hello. I think you are overthinking about your symptoms. To be conscious is good but to be over conscious may fall in the category of anxiety and is not good. I will advise you to be relaxed. Based on your symptoms, I do not feel anything to be worried of. Considering your age and symptoms of constipation and feeling something more probably pointing towards hemorrhoids or some local pathology. But physical examination and maybe flexible sigmoidoscopy would be appropriate to confirm underlying pathology or maybe online video consultation with gastroenterologist if you are worried about going to the hospital. I will advise you following general measures to follow that will help you. 1) Try to relax. Do not overthink. There is nothing serious we are thinking of. 2) Take fibers. Increase it in the diet in the form of vegetables. Add Ispagol in your diet. 3) Avoid constipation. 4) Take plenty of water. 5) Do regular walk, exercise inside your home if you can not go outside. 6) Do not strain in the restroom. 7) Take a sitz bath daily. Follow me in case you got further queries.  ",
        "Patient":"Hi doctor, I am a 22-year-old female who often suffers constipation to the point where I feel like I get minor external hemorrhoids that often bleed. Again, I have not got doctor verification for this but that is what I think. Recently, I have been experiencing pain around the left side of my stomach. I cannot localize it. Sometimes I feel like it is on my back, sometimes the lateral side, and sometimes the front. It usually happens after I eat or pass a stool but I have a minor sensation of discomfort even when I am just sitting. All of this has been getting a lot worse the past couple of days. I often feel nauseated too. I think I may have diverticulitis, however, I am not sure how common it is for my age. I also feel like I have a small localized swelling on the LUQ that hurts when I press on it. I am not sure what is wrong and I really want to go get some tests done but I do not feel safe going to a hospital with certain circumstances."
    },
    {
        "id":21,
        "Description":"Q. I am 28 years old and my weight is only 48 kg. What should I do to increase my weight?",
        "Doctor":"Hi. How is your eating habits? Your total calorie intake should be around 2200 cal\/day. This will include all three meals with a snack in the evening. You can drink any protein supplements at that time. Include ghee two to three teaspoons a day. Cheese or paneer weekly thrice. Exercise every day for 45 minutes to 1 hour. Simplest is brisk walking. Your appetite will increase with exercises. All fruits and vegetables are allowed. Take milkshakes, lassi, protein supplements after your exercise. All kinds of dals and whole pulses are allowed. Whenever you are eating high protein diet follow that by light food. For example, if you are eating channa for breakfast, eat a light lunch. Gradually increase your intake. If you follow my diet, definitely your immune system will become good. Weight gain will happen slowly. Meditation is good for psychological problems. Concentrate on positive things in life. Do not worry too much about your weight. If your overall health is good, it is a very positive sign for you. Follow up after two weeks.  ",
        "Patient":"Hi doctor, I am 27 years old. My weight is 48 kg, and height is 5.8 feet. I am a pure vegetarian. I need to increase my body weight. I am suffering from psychological problems like anxiety. I am not diabetic, BP is normal. I do not smoke and drink. Please suggest foods to increase weight, immunity, and fertility. Kindly advise."
    },
    {
        "id":22,
        "Description":"Q. I get mild left-sided chest pain with low Hb and vitamin B12 levels. Please help.",
        "Doctor":"Hello. I would like to ask you some more questions, do you have symptoms of acid peptic disease or GERD? Or any burning sensation in the epigastric region, the center of your chest (heartburn). If you do, it could also present as chest pain so I will guide you accordingly. I would also like to rule out any muscular pain, for which I will encourage you to take a muscle relaxant and see if it helps. Take tablet Muscoril (Thiocholchicoside 4 mg) one tablet once a day when you experience pain and let me know in the follow up in a couple of days to see if it relieves the pain. Like you said your Vitamin B12 levels are below normal, it could also be neuropathic pain for which I will only advise vitamin B12 supplements (tablet Methycolbalmine once a day for three months) or B complex supplements. You can also improve these levels with diet. Take diet enriched with beef, liver, and chicken. Fish and shellfish such as trout, salmon, tuna fish, and clams. Fortified breakfast cereal. Low-fat milk, yogurt, cheese, and eggs. Since your Hb is also below the ideal levels, take iron-rich foods which are usually Vitamin B12 rich as well. So I will advise diet modification to incorporate these in your everyday routine or take supplements with iron and Vitamin B12 as well. Because anemia can also present with the said symptoms. Lastly, I will encourage you to reduce weight with exercise and changing your diet and switching to a low-fat diet with the addition of more fruits and vegetables to your diet. Try to start with atleast 30-40 minutes of cardio workout every day and work it up from there according to your stamina and you will see the visible change that you feel. You will feel more active and fresh. Try to bring your BMI (body mass index) as close to the normal range as you can. Because obesity itself can cause countless problems as well. I hope this helps. ECG (electrocardiography). Do not lift heavyweights. Take low fat, high fiber diet. After two days.  ",
        "Patient":"Hello doctor, I am a 39-year-old woman. I have mild pain in the left side of the chest (below the neck and above the breast) and then sensation in the upper back from four days. It comes and goes. Sometimes it goes to the right side of the chest also. I have done my ECG and blood test 6 months ago. ECG and blood sugar were normal. No hypertension but hemoglobin was 10 and Vitamin B 12 was below average. What can I do as in lockdown it is not possible to see the doctor as a person. Please help."
    },
    {
        "id":23,
        "Description":"Q. Loose motion is not controlled with antibiotics and bland diet. What should I do now?",
        "Doctor":"Hello. I cannot see any red flags in your symptoms. More likely nothing to worry. It is the function of your intestines that is triggered by some infection and you are facing overactive intestine. More likely it is a functional problem unless proven otherwise. I will advise you to keep things simple. Quit all medications. You already took a few antibiotics. Please follow these general guidelines: 1) Add fibers in your diet like vegetables and Ispagol husk two spoons daily. 2) Keep yourself well hydrated. 3) Add yogurt in your diet. 4) Eat less. 5) More important is to keep yourself relaxed. The best way of doing is by doing a walk, exercise. Please start tablet Mebeverin 135 mg before breakfast and dinner for eight days. Tablet Rifaxamine 200 mg after breakfast and dinner. Continue probiotics. Please follow me after one week. I hope you should be fine, otherwise, I will advise you on some tests.  ",
        "Patient":"Hello doctor, I am a 39-year-old male. I am 168 cm in height and 68 kg in weight. Since last one month, I have been suffering from intermittent loose motions (yellow colored). There is no vomiting, no fever, or major abdominal pain (except for occasional cramps). Initially, I took a combination of Norfloxacin and Tinidazole for four days, but things did not improve. Thereafter on the prescription of my doctor I took Metronidazole 400 and Dicyclomine 20 mg for a period of 14 days. I also took Lactobacillus tablets for the entire period. During these times I only ate poha, rice, curd, and banana. Also, I took boiled water. It is the fifth day now and I have discontinued the medicines. Despite on such a bland diet (no wheat), I still have at least one to two loose motions in a day. My routine medical tests were done in January this year which was normal. My wife and son also developed loose motion in between for a very brief period. However, they recovered fully within three days. Please advice."
    },
    {
        "id":24,
        "Description":"Q. What should I do to reduce my weight gained due to genetic hypothyroidism?",
        "Doctor":"Hi. You have really done well with the hypothyroidism problem. Your levels are normal with less medications which are very good. As it is genetically induced, it is very difficult to lose weight. My advice to you is, you should focus on maintaining normal levels of TSH (thyroid-stimulating hormone) and try to remain active, having a positive outlook in life. Or else, it will become very difficult to balance your life with the symptoms of hypothyroidism. Even though your weight has not reduced, be very careful in not putting on weight here afterward. Everyday brisk walking for 1 hour. If you have body pain, alternate with exercises and walking. Avoid all kinds of junk foods, processed, bakery products, rich sweets, fatty foods, sodas, alcohol, and smoking. Avoid partying and binge eating. Follow the food timings properly. Have small frequent meals. In between snacks should be strictly fruits or any kind of low-calorie foods. Have unsalted nuts around five daily. It can give a glow to your dry skin. Everyday water intake should be around 1.5-2 liters. You can use flax seeds. Powder it and mix it in your food. It is a fiber which will give you fullness. Use turmeric, fenugreek seeds, or powder every day. It is a good antioxidant and fenugreek helps in reducing cholesterol levels. Include low-fat milk, curd every day. Egg white, lean chicken, or fish can be taken daily in moderation (anyone). Organ meats need to be avoided. Is your menstrual cycle normal? Please get back if you have any other complaints. Follow up after 15 days.  ",
        "Patient":"Hi doctor, I am a 22-year-old female who was diagnosed with hypothyroidism (genetic) when I was 12. Over the past five years, I have become around 50 pounds overweight and all of my attempts to lose have seemed to fail so I have given up, but my weight has stayed the same. There is so much information put there about losing weight with hypothyroidism but it all seems to conflict. I am so unsure as to what type of exercise and diet I should follow as a result but I still would like to lose weight, but most importantly have my body feel better. What can I do? I am currently on Levothyroxine, Buspar, and Benedryl."
    },
    {
        "id":25,
        "Description":"Q. Why do I get semen leakage in a very young age?",
        "Doctor":"Hi. Let me tell you that the symptoms described by you suggest that you have a nightfall problem. The high quality way to deal with dusk is the use of herbal or selfmade remedies. There are no aspect outcomes for such remedy methods. You ought to have yogurt at least two or three bowls a day. Avoid looking at porn as plenty of porn arouses you sexually. So it is recommended now not to watch porn. Sage tea – having two cups of sage tea a day will limit the probabilities of nocturnal emission. Gooseberry – popularly recognized as amla acts as an anti-oxidant and helps in lowering the nightfall. Gradually the moist goals trouble will be solved. Bathing – it is a recommendation to take bathtub earlier than you go to bed. It helps you have a sound sleep. A sound sleep is very vital for averting nightfall. I hope this helps.  ",
        "Patient":"Hi doctor, I am a 13-year-old male and I have had semen leakage for about three months. I think it is from weak nerves because last year, I would masturbate a lot but then I stopped because it was becoming painful and I was embarrassed. Then about three months ago, I watched something inappropriate and I ejaculated without doing anything. Then a week later, I started to have semen leakage every day about three to four times a day. I am just very worried and I just want this to be cured and go away. Also, could this affect my eyes in any way? Please help."
    },
    {
        "id":26,
        "Description":"Q. Should I continue the medicines for PCOS even after my periods get regular?",
        "Doctor":"Hello. If you are having regular periods in terms of flow, duration and regularities and if you have already stopped taking Ginette since March, there is no need to resume its intake immediately unless you need contraception also at the same time or not wanting a pregnancy now. In that case, you need to use an alternative mode of contraception to avoid your pregnancy. Please attach your previous prescriptions blood test and ultrasound scan reports based upon which PCOS was diagnosed. Also, inform your height weight and whether there is excessive hair in the chin, upper lip, chest, and abdomen Follow up with reports again. Also, follow the lifestyle modifications described below. Blood for serum fasting insulin levels. Blood for serum vitamin D3 levels. USG (ultrasound) TVS (transvaginal scan) if not done in the past three months. Continue vitamin D. Avoid junk food spicy and dip fried foods. Low carbohydrates, fat restricted, gluten-free diet is recommended. Regular brisk cardio excercise like walking jogging cycling swimming for at least 30 minutes a day is a must. Take frequent small meals.  ",
        "Patient":"Hello doctor, I was diagnosed with PCOS in January so my gynecologist prescribed me Ginette 35 for six months and Bonemac D3 for one month. But from March my periods are regular without taking medicines but there is sometimes slight pain in my lower abdomen and side abdomen. Should I continue medicines despite having normal and regular periods?"
    },
    {
        "id":27,
        "Description":"Q. I am 16 years old and having 3 degree scoliosis. Will it stop progressing when I grow further?",
        "Doctor":"Hello. Before going into the progress of scoliosis, I would like to make you some clarity about the facts on it. 1) The Cobb angle is a measure of the curvature of the spine in degrees. This helps to determine what type of treatment is necessary. A Cobb angle of 10 degrees is regarded as a minimum angulation to define scoliosis. 2) A scoliosis curve of 10 to 15 degrees normally does not require any treatment except for regular check-ups. 3) If the scoliosis curve is 20 to 40 degrees, the orthopedic doctor will prescribe a back brace help to keep the spine from developing more of a curve. 4) More than 45 degrees need correction surgery keeping many pedicle screw and osteotomy to correct the curve. I hope you go for x ray done of your spine and it will be easy to measure properly about the curvature.  ",
        "Patient":"Hi doctor, I am 16 years old. I just recently discovered that I have scoliosis. I do not know much about it but I will tell you what I know. My scoliosis currently has only a 3-degree curve and I am pretty confident it is a C shaped curve, although I am not sure. What do you think are the chances that my scoliosis will develop into adulthood? Do you think it will stop progressing once I am fully grown?"
    },
    {
        "id":28,
        "Description":"Q. My 2. 5 month old kid has tongue tremors. Is this due to SMA?",
        "Doctor":"Hello,  Welcome to icliniq.com. History noted as above, your 2.5-month-old has developed tongue tremors. Please provide me more detailed history such as preterm or full term, birth weight, normal delivery or LSCS. How is her weight? Is she gaining weight and let me know more about family history or any other in the family suffering from SMA (spinal muscular atrophy). SMA is confirmed only by Genetic testing or by muscle study. There are many types of SMA some of them develop symptoms later in life and a few develop in early life. Keep a watch on her development like head holds muscle tone and power and let me know me know if tongue fasciculation increases and the child becomes more hypotonic.  ",
        "Patient":"Hello doctor, I have a 2.5-month-old who I recently noticed developed a tongue tremor. I looked up online for the causes and found them as SMA. She has great motor control, we were not doing tummy time as often because she did not like it but have increased it and have seen a big improvement. My doctor believes it is benign tongue tremor, unfortunately, we had a telehealth appointment due to COVID so he was unable to see her but he told me not to worry and to keep an eye if things get worse. I am so scared it is SMA, what else should I be looking for?"
    },
    {
        "id":29,
        "Description":"Q. My braces are not activated by power chains and creating gaps. Please help.",
        "Doctor":"Hello. There are different types of power chains that are available for the treatment depending on the interlink space. 1. Short (connects every alternate bracket). 2. Long (connects every third bracket). 3. Closed (connects each bracket). So depending on the stage of your treatment, either of the types can be used which may or may not connect individual brackets. Also, we would require the history of the type of malocclusion you had in the first place as the duration of the treatment varies with the complexity of the malocclusion. Complex malocclusion which require a lot of rotations and closure of gaps may take longer than usual. Also, the density of your alveolar bone and your body's bone remodeling rate affects the duration of final results. So in order to give a definitive diagnosis, we would require your treatment history which includes - 1. Preoperative and post-operative clinic photographs (intraoral and extraoral both). 2. Preoperative dental x-rays (OPG and lateral cephalogram). 3. Treatment history including the types of malocclusion, brackets used, wires used and the movements caused. 4. Oral hygiene maintenance routine that you follow during the braces treatment. Waiting for your reply. Brush twice daily with flouride containing paste. Use of salt water gargles everyday especially after meals.Tongue cleaning on regular basis. A periodic check up with your dentist once every 6 months. A visit to the dentist for oral prophylaxis (teeth cleaning and polishing) once every six months. After providing the required information.  ",
        "Patient":"Hello doctor, Why my ortho does not put brackets in power chains while missing one or two spots? I have straight teeth and I am in the sixth year with braces. I think instead of closing gaps, this is creating gaps. Please help."
    },
    {
        "id":30,
        "Description":"Q. What does abutment of the nerve root mean?",
        "Doctor":"Hi. I have gone through your query with diligence and would like you to know that I am here to help you. For further information consult a neurologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/neurologist  ",
        "Patient":"Hi doctor,I am just wondering what is abutting and abutment of the nerve root means in a back issue. Please explain. What treatment is required for annular bulging and tear?"
    },
    {
        "id":31,
        "Description":"Q. Every time I eat spicy food, I poop blood. Why?",
        "Doctor":"Hello. I have gone through your information and test reports (attachment removed to protect patient identity). So, in view of that, there are a couple of things that I can opine upon: Hope that helps. For more information consult a general surgeon online --> https:\/\/icliniq.com.\/ask-a-doctor-online\/general-surgeon  ",
        "Patient":"Hi doctor, I am a 26 year old male. I am 5 feet and 9 inches tall and weigh 255 pounds. When I eat spicy food, I poop blood. Sometimes when I have constipation as well, I poop a little bit of blood. I am really scared that I have colon cancer. I do have diarrhea often. I do not have a family history of colon cancer. I got blood tests done last night. Please find my reports attached."
    },
    {
        "id":32,
        "Description":"Q. Will Nano-Leo give permanent solution for erection problem?",
        "Doctor":"Hi. For further doubts consult a sexologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist  ",
        "Patient":"Hello doctor, I am 48 years old. I am experiencing weak erection and difficulty in sustaining the same. This condition was observed 10 years back. Also, there is premature ejaculation. Other physical ailments that I have are, I am suffering from hypertension and taking Amlopres-L (Amlodipine and Lisinopril) for the last 10 years, high cholesterol and triglycerides. My cholesterol level is 225 and triglyceride is 200 for the last 12 years. I used to do frequent masturbation in early age. I do have erection during morning hours many times, particularly after sound sleep or if I had long walk previous day. I am having Sildenafil 25 mg or 5 mg Cialis, which is effective enough. But, I wish to get rid of tablet support and live natural way. I consulted urologist today and he prescribed me Nano-Leo capsules and Modula 5 mg for 10 days. I wish to have your second opinion on this. Please guide."
    },
    {
        "id":33,
        "Description":"Q. Will Kalarchikai cure multiple ovarian cysts in PCOD?",
        "Doctor":"Hello. I just read your query. See Kalarachi Kai choornam is helpful in amenorrhea. As far as small cysts are concerned they are unmatured eggs which failed to induce menstrual cycle previously, as a result, they got collected in the ovary and they will remain in the ovary. Now, you have got your periods you can start trying for conception. But I advise you to do it under the supervision of a nearby gynecologist because egg size is important while conception and that you can know by ovulation study. Ovulation study is performed under the supervision of a gynecologist. For gall stones, surgical intervention is required generally. Medicine is not of much help.  ",
        "Patient":"Hello doctor, I have multiple small cysts in both ovaries (PCOS). Our family friend suggested me to consume Kalarchikai medicine, powdered mixed with pepper and honey to have it for one mandalam (48 days). I have completed nearly 44 days by consuming one small ball of the mixture every morning and before two weeks I got my periods. Then I had checked whether the cysts were dissolved by having an abdomen scan. But still, small multiple follicules have been seen in it with both ovaries enlarged. Kindly suggest me what I can do further. I got married before one and a half years and I am much worried about my pregnancy. I have gallstones as well."
    },
    {
        "id":34,
        "Description":"Q. I masturbate only by rubbing the tip of the penis. Is it a wrong way?",
        "Doctor":"Hi. For further doubts consult a sexologist online -->https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist   ",
        "Patient":"Hi doctor, During masturbation I just rub the tip of the penis and not the entire penis. Is it a wrong way of doing? I do not get excited during sex and unable to ejaculate. Only, rubbing the tip of the penis gives me excitement. Also, two weeks ago, I have undergone circumcision as my foreskin did not retract. Before circumcision too, I have the same problem. Please help."
    },
    {
        "id":35,
        "Description":"Q. Holter monitor shows supraventricular ectopics and PAC. Do I need antiarrhythmic drug?",
        "Doctor":"Hello. Premature atrial contractions or supraventricular ectopics are not harmful per se other than giving you symptoms. So antiarrhythmics are not usually recommended, so I do not disagree with your treating cardiologist. Beta blocker is the safest option available, although not the most effective one and other options are ablation or antiarrhrythmics. So trying behavioral techniques is a good option. But if it troubles you a lot then you may request low dose antiarrhythmics like Amiodarone for a short period of time, but they may again come back after the drug is stopped. Since there is no atrial fibrillation or SVT (supraventricular tachycardia), antiarrhythmics are absolutely necessary, but the benefit would be in you is just symptomatic, which comes with the risk of side effects. However, you should have Holter at regular intervals like yearly (with echo for aortic regurgitation), or if you notice sustained ectopics or irregular rhythm implying development of fibrillation. You may discuss changing Atenolol to others like Metoprolol and see if its help. You should try to identify triggers like sleep or gastric disturbances, alcohol or smoking (if any), any particular medications (which you are on), stress, etc. Also, if not had recently, thyroid should be tested. So in a nutshell, antiarrhythmics may be avoided, but if not tolerable symptomatically then may be tried. I hope this helps.  ",
        "Patient":"Hello doctor,  I am a 60-year-old male who just received the results of a 24-hour Holter monitor. Key findings include: Sinus rhythm with frequent supraventricular ectopy (2559) which included couplets and one seven beat SVE multiplet. No complex forms. No significant pauses or periods of heart block noted. Constant feeling of missed beats coincides with frequent supraventricular ectopy. Very infrequent ventricular ectopy that was isolated and univocal. Cardiologists not concerned with findings and recommended positive affirmation, distraction, and cognitive behavioral strategies. He was very reluctant to recommend anti-arrhythmic treatment seeing this as overkill. Other matters of interest. Recent stress echo (March) indicated above average fitness for age (14 mets) and reached a maximum heart rate of 160 bpm. Moderate aortic regurgitation (grade 3-4), normal ejection fraction (60), LVEDV (138 mls), no demonstrable ischemia or arrhythmia. The recent PACs are very noticeable and I feel every one of them. I would appreciate a second opinion or advice on whether there is anything else I can do to stop them. I am currently on Atenolol 100 mg, Crestor 40 mg, Effexor 74 mg, and Valium 5 mg."
    },
    {
        "id":36,
        "Description":"Q. My mother has left arm and shoulder pain where she could not even lift it. Please interpret her ECG.",
        "Doctor":"Hello, Welcome to ilciniq.com. Please attach the ECG report, it is not attached. Please clarify, whether the pain is prominent feature or inability to move the arm, or is it like that she is not able to move arm because of pain or fear of pain. Now, this is not indicative of heart disease. Left arm pain without chest pain is unlikely to be related to the heart. Also, there would not be any difficulty in moving the arm with a heart attack. So it is unlikely to be related to the heart. The possibilities are, one is cervical and second is shoulder problems like frozen shoulder, or arm dislocation, even if there is no history of obvious trauma (frozen shoulder is more lifely). So she will need, 1. ECG (electrocardiography) to be sure. 2. X-ray of shoulder AP\/lateral view and maybe cervical spine if having symptoms. Next, the pulse oximeter will not helpful in ruling out heart disease. However, if she has severe shortness of breath and low oxygen reading then this may indicate heart failure, so indirectly we may infer. However, if the pain is mild and weakness is prominent then it is probably either cervical issue or neurological issue. So get her examined by local doctor and x-ray done. You may use Volini spray or Diclofenac spray. I hope this helps.  ",
        "Patient":"Hello doctor, This is about my 69 years old mother, non-obese, nonhypertensive, nondrinker\/smoker. She is not on any medication. She is unable to move her left arm for the past three days and also has shoulder pain, especially when not sitting. There was no injury to the arm. And the trouble moving her arms is such that she cannot even braid her hair. Does this indicate heart disease? Can a finger pulse oximeter reading of the affected arm be of any relevance in ruling out a cardiac issue? What about ECG reading? Please reply."
    },
    {
        "id":37,
        "Description":"Q. Why do I have blurring of vision even after treating viral conjunctivitis?",
        "Doctor":"Hello.  I have seen the picture. (attachment removed to protect patient identity).  You are having post-viral SPK (superficial punctuate keratitis) in your eyes. It is a very common condition after viral conjunctivitis. It is that small whitish scar marks on the cornea which leads to blurred vision. It will take time to resolve. You have to continue drops which have been prescribed by your doctor that is perfect drops only. So no need to worry. It can take three to six months or sometimes one year to resolve. Just continue drops which you are using right now both you should use it daily for at least a month. Then you can taper the frequency of it and slowly you can stop it. Slowly your vision will improve as lesions on the cornea will get resolved.  ",
        "Patient":"Hi doctor, I am 24 years old. Three months ago, I got viral conjuctivitis after two weeks everything was fine but eyes got blurred then my doctor recommended me Tobramycin + Fluorometholone acetate suspension and Tear Naturale Forte. Then after using it for one month my vision was clear but then doctor changed eye drops to Tobarest-F and Tear Naturale Forte. Now my vision is getting blurred again. What should I do? Now I have no other problem such as redness, itching, etc., just blurry vision is there. Please help."
    },
    {
        "id":38,
        "Description":"Q. My father has mild to moderate abdominal pain for the past 5 days. Please suggest medication.",
        "Doctor":"Hello. I can understand you must be very upset about your father's health. Well, you see the abdominal pain in such age is often an alarming finding, and I urge you to get him some investigations before giving any blanket cover of medicines. Common possibilities in his age are: 1. Mesenteric ischemia, which is the narrowing of the blood vessel supplying the blood to abdominal organs. This can frequently occur in old age with diabetes and hypertension. The pain arises because of lack of blood supply to organs like small bowel, large bowel, and others. 2. The second possibility is pain due to any organ within the abdomen which is inflamed commonly the pancreas (a gland over the back of the tummy), and large bowel. 3. And lastly, since he has a problem with constipation the gas accumulation can also be the reason of his abdominal pain. But remember, we cannot say that it is because of gas distension unless we exclude all other possibilities which are more concerning. I suggest you to get investigations which I write below. Only after the investigation, we can be able to diagnose the problem and treat it appropriately. I really hope this set of investigations will help us to approach the problem correctly. Mesenteric ischemia. Pancreatitis, gall bladder or common bile duct stones. Colitis, colonic neoplasia. Gas, constipation related. Compete blood count. Serum amylase and lipase. Liver function tests. Serum lactate level and serum CRP (c-reactive protein). HbA1c (glycated hemoglobin). Lipid profile. Stool for detailed report. Stool for occult blood on consecutive three days. Stool for fecal calprotectin. Capsule Esomeprazole 40 mg half an hour before meals. Ispagol husk two tablespoons full with water daily. Follow up after investigation.  ",
        "Patient":"Hello doctor, My father is 71 years old. He having abdominal pain in the middle for the past four to five days. Pain is constant and mild to moderate in intensity. He is not having any issue in passing stools or urine but sometimes complains of burning sensation while passing stools. His appetite is good. No vomiting or diarrhea. No fever. His current medial history includes diabetes and hypertension. He is an Alzheimer patient. Can you please prescribe some medication for his abdominal pain."
    },
    {
        "id":39,
        "Description":"Q. I get watery eyes, blocked nose and sneezing during particular season. Please help.",
        "Doctor":"Hi,  Welcome to icliniq.com. The symptoms you have mentioned are of allergic rhinitis. But it is just not sneezing and watering of eyes. It causes major complications in your body starting from sinusitis to asthma which becomes permanent to your life. We have to curb it in its initial stages.  First complete cleaning of fans in your room and also the pillow covers and bed sheet. Use the mask as much as possible to prevent yourself from dust exposure. Montek FX (Montelukast and Fexofenadine) just gives you symptomatic relief on that day. You have to advance to nasal sprays and nasal washes as a permanent solution. Advance anti-allergic drugs have to be started. I need to know the details of allergies possible and have to remove the source.  ",
        "Patient":"Hello doctor, My symptoms are watery eyes, blocked nose, sneezing, and runny nose with transparent fluid coming out of my nose. It gets worse when I have something from the refrigerator but I am sure it is not common cold. What other doctors diagnosed was that I have got allergic rhinitis. I feel fine sometimes when I take Montelukast FX but sometimes even Montelukast does not help. This allergy starts from starting June to about September but it is hard to live with a runny nose and sneezing."
    },
    {
        "id":40,
        "Description":"Q. I had wine and took Corticosteroid during early days of pregnany. Will it harm my baby?",
        "Doctor":"Hello.  As you have not mentioned the date of your last menstrual period, I am assuming by day 0 you mean the starting date of last menstrual cycle. Because we calculate the pregnancy age from that date. So yes, the early pregnancy time is very important because the embryo is developing in that time period. So as per your query, as you mentioned the consumption of wine in the early three weeks, I do not think it is gonna have any effect on the embryo because it is in the preovulatory phase when even the egg is being formed and released. And yes, corticosteroid in high doses when used for chronic medical conditions can have a risk of cleft lip and palate, but a single shot taken for an allergic reaction should not be affecting the baby. Also, the Flucloxacillin is a penicillin group of drug which is usually safe in pregnancy. So be calm and stop worrying about the risks. It will just increase your stress levels. Moreover in early pregnancy, if any embryo is grossly affected by any insult, it either usually aborts early if the exposure has been hazardous, but if the exposure is nonhazardous, it makes through and the baby will be fine. This is called all or none phenomenon in pregnancy. So your exposure to the medications was not that is something very dangerous, so rest assured. And more over your pregnancy has reached until 6 weeks, that is a good sign that the embryo has not been affected by the exposure to the drugs you have been worrying about. Please consult your gynecologist for your antenatal checkup and investigations required to be taken as per your local protocols. USG (ultrasound) for dating and viability. NT (nuchal) scan with dual marker test between 11-13 weeks. Routine antenatal investigations as per your local protocols. Tablet Folic Acid 5 mg daily once after food until 13-14 weeks. Avoid sexual intercourse until 14 weeks. Consult your gynecologist before any medications intake or to review the medications already taking for chronic medical conditions.  ",
        "Patient":"Hi doctor, I am in week 6 of my pregnancy and I am worried about some things that happened very early in the pregnancy before I knew I was pregnant. I had a few glasses of wine from day 0 to day 20. A total of six maybe and one glass and a half on day 20. I also took corticosteroids (Betamethasone) a single dose of 3 mg due to an allergic reaction on day 20. And as if this was not enough, I was also on antibiotics (Flucloxacillin) which I finished on day 24 of pregnancy. I am so afraid all of this might have had an impact on the baby. Is there a risk my baby might have been affected?"
    },
    {
        "id":41,
        "Description":"Q. I have oily skin with pimples and white heads leaving brown scars. Please suggest solution.",
        "Doctor":"Hello. Attach a picture of the lesion for details. Use Ahaglow face wash twice daily for 15 days. Are there pustules? Inflammatory red lesions? Photosensitivity?  ",
        "Patient":"Hello doctor, I have an oily skin type. Recently I am experiencing pimples, white bumps, red dots on my cheeks close to my ears. Sometimes I feel very itchy near the pimples. I have developed one or two new big pimples on my forehead also. When the pimple subsides after a week or two it leaves a reddish brown mark on that area. I feel the need to wash my face very often as it starts feeling very heavy and sticky from all the oil on my face. I used Clear Gel for some time but it is not working on my skin. Not using any other medication at the moment. Kindly help me with the same."
    },
    {
        "id":42,
        "Description":"Q. My LFT is raised for a year with recent AST, ALP, and GGT showing 200. Please help.",
        "Doctor":"Hello. I can imagine that you must be very concerned about your persistent elevation of the liver enzymes. As you already have viral etiologies excluded this is time to look for other things which could lead to persistent elevation of the liver enzymes. Notably the Wilson, alpha, antitrypsin deficiency, hemochromatosis, autoimmune hepatitis type II. I want you to upload all your previous investigations, ultrasound reports if done, and any other testing that you have been performed in the past two years. I also suggest you to get following blood tests which would help us excluding the above possibilities. It is possible that you have some testing already and I do not want that you should repeat it but do upload the reports as I can see those. Secondly, despite you had a viral screening that showed nothing abnormal but there are certain other tests like Hb core total which can tell occult or latent infection and cause of your raised enzyme levels. Since the investigation may cause you significant cost it is possible alternative that you can discuss with me in detail, as we can shrink some of those testings by closely inquiring about those causes in history before getting tested. I am sure we would reach a conclusive diagnosis by relevant information you provide and after investigations. Wilson. Hemochromatosis. Autoimmune hepatitis type II. Alpha antitrypsin deficiency. Chronic viral hepatitis. Complete blood count. Liver function test (fresh) and all previous as I can see the trend Hb core total. HbsAb, HbsAg. Serum ceruloplasmin. Serum copper, ferritin, and transferrin saturation. Anti LKM 1 antibody. Serum alpha antitrypsin level. Autoimmune or other metabolic diseases. Follow up after investigations and all previous reports or earlier if want to discuss before getting tested.  ",
        "Patient":"Hi doctor, I am 23 years old. It has been more than a year my liver function test result remains high. I have been tested for hepatitis A, B, C, E, and autoimmune hepatitis, but the result all came out negative. My doctor told to take blood test regularly. But, it has been almost a year now, the result still remains high. The lowest result so far I get is AST 90. But my latest liver function test result shows my AST, ALP, and GGT all 200+. May I get any advice on this? I did not take any medication, consume any alcohol, but the result still came out high. I am so worried about that. Please help."
    },
    {
        "id":43,
        "Description":"Q. Jardiance for type 2 diabetes is causing penile infection and balanitis. Please suggest an alternate medicine.",
        "Doctor":"Hi,  Welcome to icliniq.com. Urinary infection is the most common side effects of the Empagliflozin (Jardiance). Maintaining thorough hygiene and plenty of water. I can advice you for a change in medication but you need to be very vigilant initially for any fluctuations. Your exact blood sugar values might have given a better understanding though. Below I am modifying your medication of Gemer and adding Voglibose. Stop using Jardiance. Be very strict to yourself in having controlled diet with more of fruit and salads. Regular yoga and exercise. Tablet Gemer DS (Glimpiride) 3 mg in the morning 15 minutes before breakfast. Tablet Voglibo (Voglibose) 0.2 mg just before first bite of your breakfast. Rest continue with the same medication at night. You may have some stomach disturbances initially but may settle down eventually. Have good enough amount of curd in your diet. Measure your values especially after four to five days and get back to me for advice so that depending on how you are managing can decide for any modifications or continuation of the same treatment.  ",
        "Patient":"Hello doctor, I am 30 years old and I am a type 2 diabetic. Right now I take Lantus 30 unit at night. In the morning, I take Gemer DS 2 and after breakfast, I take 12 mg Jardiance. Now my sugar is under control, but because of Jardiance I usually have penile infection and balantitis. I have googled that Jardiance have side effects of these types because it flush out sugar from urine. Can I take any other medicine like Voglibose or other which has good efficacy? Or should I take Novorapid along with Lantus at morning meal?"
    },
    {
        "id":44,
        "Description":"Q. Two teeth missing in my lower jaw. Do I need to extract tooth in upper jaw to get braces?",
        "Doctor":"Hello. I went through your query and the attached image (attachment removed to protect patient identity). You have two lower second premolars extracted with no third molars in the lower jaw. Little bit crowding is seen in both upper lateral incisors that might be the reason for you opting for braces. Well, as a specialist upper tooths have a little bit of space in between the central incisors. Upper front teeth need proximal slicing to facilitate space that space will be enough to realign your both upper lateral to the arch. Although it is just a front profile if possible upload a side profile of your face to evaluate the overjet but I can say just marginal and proximal slicing of the upper front teeth will be enough, and no further extraction needed. Meanwhile, you have missing both lower second premolars. Get a fixed bridge to cover the gaps or else they will shift and get malaligned. Upper third molar are also fine and does not need extraction in the near future. Go for normal braces instead of Invisalign. Normal braces work much better in these cases.  I hope this helps.  ",
        "Patient":"Hello doctor, I have two missing teeth in the left and right side of my lower jaw so I have now 16 teeth upper jaw because I have the wisdom there as well and 12 teeth in lower jaw no wisdom. Can I get the invaslign or just braces will be good and do I have to extract teeth from my upper jaw?"
    },
    {
        "id":45,
        "Description":"Q. What does abutment of the nerve root mean?",
        "Doctor":"Hi. I have gone through your query with diligence and would like you to know that I am here to help you. For further information consult a neurologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/neurologist  ",
        "Patient":"Hi doctor,I am just wondering what is abutting and abutment of the nerve root means in a back issue. Please explain. What treatment is required for annular bulging and tear?"
    },
    {
        "id":46,
        "Description":"Q. Every time I eat spicy food, I poop blood. Why?",
        "Doctor":"Hello. I have gone through your information and test reports (attachment removed to protect patient identity). So, in view of that, there are a couple of things that I can opine upon: Hope that helps. For more information consult a general surgeon online --> https:\/\/icliniq.com.\/ask-a-doctor-online\/general-surgeon  ",
        "Patient":"Hi doctor, I am a 26 year old male. I am 5 feet and 9 inches tall and weigh 255 pounds. When I eat spicy food, I poop blood. Sometimes when I have constipation as well, I poop a little bit of blood. I am really scared that I have colon cancer. I do have diarrhea often. I do not have a family history of colon cancer. I got blood tests done last night. Please find my reports attached."
    },
    {
        "id":47,
        "Description":"Q. Will Nano-Leo give permanent solution for erection problem?",
        "Doctor":"Hi. For further doubts consult a sexologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist  ",
        "Patient":"Hello doctor, I am 48 years old. I am experiencing weak erection and difficulty in sustaining the same. This condition was observed 10 years back. Also, there is premature ejaculation. Other physical ailments that I have are, I am suffering from hypertension and taking Amlopres-L (Amlodipine and Lisinopril) for the last 10 years, high cholesterol and triglycerides. My cholesterol level is 225 and triglyceride is 200 for the last 12 years. I used to do frequent masturbation in early age. I do have erection during morning hours many times, particularly after sound sleep or if I had long walk previous day. I am having Sildenafil 25 mg or 5 mg Cialis, which is effective enough. But, I wish to get rid of tablet support and live natural way. I consulted urologist today and he prescribed me Nano-Leo capsules and Modula 5 mg for 10 days. I wish to have your second opinion on this. Please guide."
    },
    {
        "id":48,
        "Description":"Q. Will Kalarchikai cure multiple ovarian cysts in PCOD?",
        "Doctor":"Hello. I just read your query. See Kalarachi Kai choornam is helpful in amenorrhea. As far as small cysts are concerned they are unmatured eggs which failed to induce menstrual cycle previously, as a result, they got collected in the ovary and they will remain in the ovary. Now, you have got your periods you can start trying for conception. But I advise you to do it under the supervision of a nearby gynecologist because egg size is important while conception and that you can know by ovulation study. Ovulation study is performed under the supervision of a gynecologist. For gall stones, surgical intervention is required generally. Medicine is not of much help.  ",
        "Patient":"Hello doctor, I have multiple small cysts in both ovaries (PCOS). Our family friend suggested me to consume Kalarchikai medicine, powdered mixed with pepper and honey to have it for one mandalam (48 days). I have completed nearly 44 days by consuming one small ball of the mixture every morning and before two weeks I got my periods. Then I had checked whether the cysts were dissolved by having an abdomen scan. But still, small multiple follicules have been seen in it with both ovaries enlarged. Kindly suggest me what I can do further. I got married before one and a half years and I am much worried about my pregnancy. I have gallstones as well."
    },
    
    {
        "id":476,
        "Description":"Q. I get hives on thighs whenever the climate is hot. How long can I take Claritin?",
        "Doctor":"Hi,  Welcome to icliniq.com.  It looks that you are suffering from acute urticaria. This could happen as a result of an allergic reaction to blanket dust or furs in it. There are other causes as well. Is this the first episode? Or you get them frequently? Any history of diabetes or thyroid? Any history of any medicine taken recently for some other issues? Until you reply, you can take Clairtin (Loratidine) dose again. No problem with that. I hope this helps.  ",
        "Patient":"Hello doctor, I am a 17-year-old female. I believe that I have hives on my thighs. I have them for about five to six days and they appear whenever the area gets hot. I was using a blanket last night and the hives got red again but when it is cold, they are not red and appear to be my skin color. I used Hydrocortisone the first three days and it helped, and I was also wearing tight leggings while working all day. The last two days, I have been taking Claritin and it has helped because the area is no longer itchy but the hives and bumps are still there. Should I take Claritin tonight too? How do I get rid of the bumps? I assume that I should not keep on using Claritin since I have used it for two days already."
    },
    {
        "id":477,
        "Description":"Q. I am a 13 year old male. How to assess my present stage of puberty?",
        "Doctor":"Hi. I appreciate your efforts of going into the details about puberty and its effects on the body. You have done quite a bit of research. You only need to understand a few more things. First, not everybody’s body responds the same way to puberty. The genetic makeup has a big influence on it. Your final height depends on your parents’ height, lifestyle diet, physical exercise, and also mildly influenced by the mindset and environmental factors. Generally, boys grow up to 18-20 years of age unless the growth is arrested by early puberty. By your description, your puberty is just setting in, which is normal for the age. Now, your final height will depend on your diet and physical activity. It is possible that you might add another 4-5 inches to your height.  ",
        "Patient":"Hi doctor, I am 13 years old. I have been curious about puberty and height. I am currently 5 feet 6 inches and really insecure about my body and height. I feel very hairy and fair. I have been researching tanner stages of development and I am around tanner stage 4. I have hair around my inner thighs, I can grow a slight mustache in three weeks, I have line of hair from my testicles to my belly button forming. I have little hair around my nipple and some hair on my underarms. I have lots of leg hair and a medium amount of arm hair, my penis is 6.5 inches erect and 4 inches flaccid. I have attached a photo. I wear a shoe size of 11. How tall can I expect to be and how far into puberty really am I? I also have hairy parents."
    },
    {
        "id":478,
        "Description":"Q. I have severe rib pain and it hurts more while standing and taking deep breaths. Please help.",
        "Doctor":"Hello. There are many conditions where we can get chest pain along with ribs pain. I would like to ask a few questions. Is that pain on costochondral junction which means if you palpate your ribs you can feel there is one gap and then the other rib is started. So pain in that region is costochondritis but the pain is like neurogenic pain sharp and localized (at specific). Does that pain radiates to the tip of shoulder or not? Is the pain associated with other symptoms like palpitation? Had you done exercise one day before and got pain? Meanwhile, I would recommend you start one drug and let us work on your problem. Also, remember anxiety and panic attacks can cause symptoms very similar to angina. These attacks which can occur out of the blue or in response to a stressful event include chest pain along with shortness of breath, palpitations, and dizziness. Take tablet Parafon Forte (Chlorzoxazone) 500 mg per oral three daily after food for three days. This prescription for you helps relax certain muscles in your body and relieve the discomfort caused by acute (short-term), painful muscle, or bone conditions.  ",
        "Patient":"Hello doctor, I am having severe rib pain since this morning and it hurts when I stand up straight or when I move or lay down. I tried putting a heating pad and ice pack on it and did not do anything. I feel extreme discomfort, cannot take deep breathes, and feel sharp stabbing pain once in a while."
    },
    {
        "id":479,
        "Description":"Q. My penis is like an hourglass and bends in a weird way while erect. Is this Peyronie's disease?",
        "Doctor":"Hi. After reviewing your history, it seems to me Peyronie’s disease but I need pictures (flaccid, partial, and complete erection) from you to confirm it. Presentation is secondary to fibrosis in tunica Albuginea causing curvature of penis on erection to variable degrees. It starts with inflammation and pain but will stabilize and become painless with time over approximately six months. Its causing factors are not exactly known but related to microvascular injury and healing with fibrosis is more common in diabetics and might be secondary to autoimmune diseases. Diagnosis is made purely on clinical grounds by history examination and pictures. Treatment ranges from medications to local injections to surgery which is reserved for significant deformity and curvature. I would be grateful to further diagnose and follow up on you. Please send me pictures to support the diagnosis before I make a strategy for your treatment. Provide pictures.  ",
        "Patient":"Hello doctor, I am a 24-year-old male. I have noticed that my penis gets really narrow in the middle like an hourglass and bends in a weird way when half erect or in the process of getting erect. It gets completely normal when fully erect though and there is no pain. This happens once every few days. Should I be worried? I have tried searching online and the closest result is Peyronie's. However, in Peyronie's the erect penis gets the hourglass shape with pain but in my case erections are just fine. Any help would be greatly appreciated as I am quite worried."
    },
    {
        "id":480,
        "Description":"Q. What does abutment of the nerve root mean?",
        "Doctor":"Hi. I have gone through your query with diligence and would like you to know that I am here to help you. For further information consult a neurologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/neurologist  ",
        "Patient":"Hi doctor,I am just wondering what is abutting and abutment of the nerve root means in a back issue. Please explain. What treatment is required for annular bulging and tear?"
    },
    {
        "id":481,
        "Description":"Q. Will Nano-Leo give permanent solution for erection problem?",
        "Doctor":"Hi. For further doubts consult a sexologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist  ",
        "Patient":"Hello doctor, I am 48 years old. I am experiencing weak erection and difficulty in sustaining the same. This condition was observed 10 years back. Also, there is premature ejaculation. Other physical ailments that I have are, I am suffering from hypertension and taking Amlopres-L (Amlodipine and Lisinopril) for the last 10 years, high cholesterol and triglycerides. My cholesterol level is 225 and triglyceride is 200 for the last 12 years. I used to do frequent masturbation in early age. I do have erection during morning hours many times, particularly after sound sleep or if I had long walk previous day. I am having Sildenafil 25 mg or 5 mg Cialis, which is effective enough. But, I wish to get rid of tablet support and live natural way. I consulted urologist today and he prescribed me Nano-Leo capsules and Modula 5 mg for 10 days. I wish to have your second opinion on this. Please guide."
    },
    {
        "id":482,
        "Description":"Q. Every time I eat spicy food, I poop blood. Why?",
        "Doctor":"Hello. I have gone through your information and test reports (attachment removed to protect patient identity). So, in view of that, there are a couple of things that I can opine upon: Hope that helps. For more information consult a general surgeon online --> https:\/\/icliniq.com.\/ask-a-doctor-online\/general-surgeon  ",
        "Patient":"Hi doctor, I am a 26 year old male. I am 5 feet and 9 inches tall and weigh 255 pounds. When I eat spicy food, I poop blood. Sometimes when I have constipation as well, I poop a little bit of blood. I am really scared that I have colon cancer. I do have diarrhea often. I do not have a family history of colon cancer. I got blood tests done last night. Please find my reports attached."
    },
    {
        "id":483,
        "Description":"Q. Will Kalarchikai cure multiple ovarian cysts in PCOD?",
        "Doctor":"Hello. I just read your query. See Kalarachi Kai choornam is helpful in amenorrhea. As far as small cysts are concerned they are unmatured eggs which failed to induce menstrual cycle previously, as a result, they got collected in the ovary and they will remain in the ovary. Now, you have got your periods you can start trying for conception. But I advise you to do it under the supervision of a nearby gynecologist because egg size is important while conception and that you can know by ovulation study. Ovulation study is performed under the supervision of a gynecologist. For gall stones, surgical intervention is required generally. Medicine is not of much help.  ",
        "Patient":"Hello doctor, I have multiple small cysts in both ovaries (PCOS). Our family friend suggested me to consume Kalarchikai medicine, powdered mixed with pepper and honey to have it for one mandalam (48 days). I have completed nearly 44 days by consuming one small ball of the mixture every morning and before two weeks I got my periods. Then I had checked whether the cysts were dissolved by having an abdomen scan. But still, small multiple follicules have been seen in it with both ovaries enlarged. Kindly suggest me what I can do further. I got married before one and a half years and I am much worried about my pregnancy. I have gallstones as well."
    },
    {
        "id":484,
        "Description":"Q. I masturbate only by rubbing the tip of the penis. Is it a wrong way?",
        "Doctor":"Hi. For further doubts consult a sexologist online -->https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist   ",
        "Patient":"Hi doctor, During masturbation I just rub the tip of the penis and not the entire penis. Is it a wrong way of doing? I do not get excited during sex and unable to ejaculate. Only, rubbing the tip of the penis gives me excitement. Also, two weeks ago, I have undergone circumcision as my foreskin did not retract. Before circumcision too, I have the same problem. Please help."
    },
    {
        "id":485,
        "Description":"Q. My lipid profile is deranged with high triglycerides. Should I start on medication?",
        "Doctor":"Hi. I can understand your concern. According to your statement, you have been suffering from back pain and hypertriglyceridemia with low HDL (high density lipoprotein) level. You have a high VLDL (very level density lipoprotein) level too. For your abnormal lipid profile level, you should avoid fatty foods and dairy products. You can take Fenofibrate for your high triglycerides level along with Omega-3 fatty acid for your low HDL level. Continue these medications for abnormal lipid profile and do repeat your lipid profile after three months later. For your back pain, you can take Naproxen with Baclofen, Calcium with vitamin D supplements. So you can continue the medications as follows. Capsule Lofibra (Fenofibrate) 200 mg 0+0+1 (after meal), tablet Naprosyn 500 mg 1+0+1 (after meal) for 10 days, tablet Lioresal (Baclofen) 10 mg 1+0+1 for one month, tablet Carbocal D 400 0+1+0 for two months, capsule Bio Marine, Omega-3, and Fish oil 0+1+0 (continue), tablet Prevacid (Lansoprazole) 30 mg 1+0+0 (before meal) for one month.  ",
        "Patient":"Hello doctor, I am 34 years old. My lipid profile shows: Total cholesterol 154 mg\/dL HDL 26.8 mg\/dL LDL 67.9 mg\/dL Triglyceride 298 mg\/dL FBS is 95mg\/dL and RBS 132 mg\/dL. Blood pressure 146\/82 mmHg. Can I use the cholesterol medicine for triglycerides?"
    },
    {
        "id":486,
        "Description":"Q. My 40-day-old son has undescended left testis. Will it come down on its own or surgery required?",
        "Doctor":"Hi. According to the report you have sent (attachment removed to protect patient identity), the child has left-sided undescended testis. It is a common practice to wait until the baby is six months old before operating. There is a small chance that the testis might descend on its own by six months. They usually do not descend after six months and also the risk of that testis becoming nonfunctional if waited beyond six months is high. Another thing is, there is a small risk of that testis becoming cancerous if it is not operated within one year. So, your child will need a surgery orchidopexy by about six months of age if it does not descend spontaneously. Follow up at 6 months of age.  ",
        "Patient":"Hello doctor, My 40-day-old son's left testis is undescended. Sonography shows his testis on the upper end of the inguinal canal. Please suggest whether it will come down naturally."
    },
    {
        "id":487,
        "Description":"Q. If gallbladder stones are not removed shortly, will it turn cancerous?",
        "Doctor":"Hello. I can understand your concern about symptoms complex and ultrasound findings and whether surgery is the answer to your problem. Well, first of all, I want to clear that you do not have stones in the gallbladder. They are concretions. It is a medical term and they are called microlithiasis (gall bladder stones less than 3 mm in size). So the possibility of developing cholecystitis (gall bladder inflammation) is very low. However, this microlithiasis can cause pancreatitis (inflammation of the pancreas which is a gland sitting over the back of the abdomen). Thirdly, the pain can be secondary to the functional gall bladder problem, where the gall bladder is naturally slow resulting in damping of bile (yellow secretion produced by the liver and stored within gallbladder) and production of small concretions such as in y our case. So I would ask you to get a few blood tests to confirm whether you have pain due to pancreatitis. I also want that you should discuss to me in more detail about your pain, as only proper history can give me a clue towards your problem whether gall bladder inflammation, pancreatitis, or functional gall bladder disorder even before any further testing. Since the ultrasound findings and your symptoms are not correlated very well, there is no point in discussing the role of surgery. But I just want to assure you that you probably need no surgery, so do not worry about it. I suggest you some tests, please get it done, then I would recommend you some lifestyle changes and a medical treatment that can help you resolve your minor stones within the gallbladder. I hope this helps. Pancreatitis. Cholecystitis. Peptic ulcer disease. Functional gallbladder disorder (gallbladder dyskinesia). Complete blood count. Serum amylase and lipase. Liver function tests. TSH (thyroid-stimulating hormone). Start capsule Esomeprazole 40 mg half an hour before meals once daily for now. Follow up after investigation.  ",
        "Patient":"Hello doctor, My friend is having a gall bladder stone. We consulted few doctors, some are saying the immediate operation is needed otherwise it will be cancerous and some are saying no immediate action is required. She is having pain in her right side of the upper abdomen and also in the middle. I am attaching her ultrasound report. Please tell me about her condition. During this pandemic, we are not able to go outside and consult the doctor."
    },
    {
        "id":488,
        "Description":"Q. I have elevated lipid profile and low vitamin D. Should I start medicines?",
        "Doctor":"Hello. I have gone through your reports (attachment removed to protect patient identity). Your lipid profile and liver enzyme ALT are deranged and Vitamin D is low. For low Vitamin D, you should have tablet Uprise D3 (or Calcirol sachet) 60,000 units once a week with milk for eight weeks. After eight weeks, you should have it once a month for the next six months. Now the liver enzyme is deranged likely due to fatty liver, which is related to deranged lipid profile. You should get an ultrasound of liver to confirm it. Now since LDL (low density lipoprotein) is moderately elevated, you may give a try of a healthy lifestyle. So you should have a healthy lifestyle like avoiding fatty, oily, high calorie foods. Avoid fried, fast food, egg yellow, non veg consumption, and avoid excessive oil. Do not reuse the cooking oil once used for frying. Have regular exercises like brisk walking or running according to the capacity for atleast 30 minutes a day. Repeat lipid profile after eight weeks and if there is a response then should continue a healthy lifestyle or else will medications like tablet Atorva (Atorvastatin) 10 mg bedtime once daily for six to eight weeks. I hope this helps.  ",
        "Patient":"Hello doctor, I am 39 years old. Recently I have done some health check ups. The report shows my LDL cholesterol is 140, Triglycerides -165, HDL-30. Should I take any medicine? Or should I start walking or exercise? My vitamin-D level is 20.15. What medicine should I take for my low levels of Vitamin D?"
    },
    {
        "id":489,
        "Description":"Q. I have troubled gut with gas, constant rumbling in stomach, and frequent burps. Please help.",
        "Doctor":"Hi. If your gut is not normal, it will definitely affect your skin. First thing, include a lot of probiotics in your diet. Take two cups of curd daily. Have small frequent meals like two to three hours eat something. Your meal should be breakfast, lunch, and dinner with two intermittent snacks. Include ghee every day in your diet. Add one or two teaspoons ghee with rice along with other accompaniments. Stop the Cod liver capsules completely. Supplements should not be taken for years together. Occasionally if you eat homemade sweets, nothing will happen. You can take it as your weight is very low. For in-between snacks, you can eat fruits, buttermilk (include every day), protein powder in the evening, channa, etc. Always have protein-rich foods in the morning hours and the later meal should be light. Avoid breads, bakery products, processed foods, sodas, rich sweets, junks, etc. Get a complete blood test done. Follow up after a week with your reports.  ",
        "Patient":"Hello doctor, For the last year or so I have been experiencing a troubled gut, gassy disposition, constant rumbling in the stomach, and frequent burps. Since then I have stopped consuming lactose, heavy foods such as cheese, full-fat milk, and paneer since but my stomach is still unsettled a year on. I have also noticed that over the last three months my skin has been breaking out on the chin, forehead, and cheeks. This coincides with the start of the lockdown where I live. I have never experienced acne or other skin issues before. My diet has remained the same vegetarian, lactose-free, a decent amount of fruits and veggies, next to no sweets, ghee, butter, chapatis, and rice. I do not smoke at all and drink very infrequently. I do not skip meals. I do not take supplements currently, only Cod liver oil capsules for immunity for the last 5-6 years. How do I improve my gut health and does it have anything to do with my sudden skin problems?"
    },
    {
        "id":490,
        "Description":"Q. I am getting intense pelvic pain between 18-24 days of my cycle. Why?",
        "Doctor":"Hello. The pain you have been experiencing is most likely the ovulatory pain, typical to occur in the midcycle when one has regular cycles of 28-30 days, or if you have you menstrual periods of varying dates, you can observe that exactly 14 days prior to the menstrual period. It is called Mitterschmerz syndrome or pain. It is a normal phenomenon and usually mild but rarely it can be severe. As your pain has been severe today, it would be better to get an ultrasound done to rule out any other causes of your pain. If you had mentioned the date of your last menstrual periods, it would have been helpful. You can take antispasmodic medications and see if the pain gets relieved, But if it does not, then it would be better to seek emergency medical help. And I am assuming that chances of pregnancy have been ruled out, if not then please evaluate yourself (just in case if sexually active). I hope this helps.  ",
        "Patient":"Hello doctor, I am 18 years old. And about five or six times in the past year, I have experienced intense, nauseating pain that I can only guess is ovarian, but I cannot find anything on the internet to really pinpoint it. It alternates sides, lasts for a couple of hours, and is always between days 18-24 of my cycle. This morning it lasted hours, the pain reaching from my left ribs to my pelvis, which felt like a lot of pressure and made it painful to urinate."
    },
    {
        "id":491,
        "Description":"Q. My x-ray shows discontinuity in medial tubercle of talus. Please suggest treatment options.",
        "Doctor":"Hello. Looking into your x-ray pictures (attachment removed to protect patient identity) and reading your problem, I got to know about linear undisplaced fracture of the talus. We need to understand the function of the talus bone and its role in the movement of ankle and foot. It is between the leg and the foot so that bodyweight may be transferred from the ankle to the leg, helping to walk while maintaining balance. The bone also helps in the movements of the ankle, and together with the calcaneus facilitates the movements of the foot. It has already been I think more than 15 days have to outcast or do immobilization of foot? It is needed to immobilize the foot and take some medicine. If you have swelling of moderate type then put splint for 10-14 days and convert to cast. Then we need to do check an x-ray around in four weeks and then in six weeks and see the final callus formation and healing.  ",
        "Patient":"Hello doctor, I am 24 years old. Last month, I had a motorcycle accident. I did an x-ray and it is written in the result as: There are bone discontinuity seen in the medial tubercle of the talus of the calcaneus. Such can represent an incomplete linear fracture. No osseous reaction or radiopaque foreign body noted in the projection taken. Boehler angle 42°. What are the best over the counter medicines for my fracture?"
    },
    {
        "id":492,
        "Description":"Q. My mother is suffering from a mental disorder for 24 years. Can she recover?",
        "Doctor":"Hello , I am sorry to hear about your situation. I can imagine how hard it must be for you. In your query you have not mentioned the diagnosis so I can't suggest exactly what needs to be done but I will explain how it works .. The fact that you mentioned that she doesn't remember anyone could be a part of 1. Dementia for which you would require a neurologist , Medications can help to an extent . 2. Psychosis or Depression can have such reactions , you will require a Psychiatrist for this . A complete evaluation is required , the doctor might do a CT\/ MRI depending on the symptoms and start treatment accordingly and yes Medications can help to an extent depending on severity of the issue. One way is to get her treated on OPD basis ie at home with followuos with doctor , or you can opt for residential treatment facilities which keep the patient in the facility and there is a holistic approach to treatment where doctor , nurses , therapist , etc works as a team in recovery . I would need more information about symptoms or need to talk to your mother to be able to understand exactly what she is going through . I hope this helps .. Feel free to contact me if you have any questions. take care .  ",
        "Patient":"Respected sir\/madam, My mother has been suffering from mental disorder since 24 years (from my birth) . My dad took her to the hospital and undergone treatment also but no use , after up to 2 years prescribed medicine also used . It had been 20 year of not using any medicine and treatment . Since my birth  i hadn't my mother's love and care . Now I want to get her treatment . Her condition right now she is healthy , don't remember anyone ,quiet calm , sometimes do whatever we told. Is there any chance to recover ?  Please give me some advice as I don't know what to do?"
    },
    {
        "id":493,
        "Description":"Q. I have jaw pain because of an impacted wisdom tooth. What should I do?",
        "Doctor":"Hello, welcome to iCliniq. This may be the pain from the same reason you had previously. If you have an impacted wisdom tooth, then that can cause you this kind of problem repeatedly. But if you have pain on biting, that may be from the root canal treated tooth. Do you have the xray? Can you send me a picture of the affected area and the xray ? In the meantime, you can rinse mouth with warm saline water 5-7 times daily. If the pain doesn't subside, you can take painkiller... Tab Ibuprofen (400mg) two times daily for 2\/3 days (after meal) Please send me the pictures for proper diagnosis and better treatment plan. Thank you for contacting us.  ",
        "Patient":"I'm having ache in lower jaw. Last time i visited dentist...i had a root canal same side After a month i started experiencing pain in that jaw sometimes... Doctor said root canal is fine and that i have impacted wisdom tooth after a quick x ray. I am having pain now again in that jaw after 3 months. What should i do? Due to covid 19 I'm not sure i should visit a dentist"
    },
    {
        "id":494,
        "Description":"Q. I have back pain, tiredness, feeling sleepy, and foot inflammation. What could have caused all these?",
        "Doctor":"Hi. I can understand your concern. According to your statement, you have been suffering from back pain, tiredness, more sleepy feeling, and inflammation on foot. I have gone through your investigations (attachment removed to protect patient identity) result and found that your Vitamin D3 level is below normal, GGT (gamma-glutamyl transferase) level slightly high, HDL (high dentisy lipoprotein) level below normal, TG (thyroglobulin) and VLDL (very density lipoprotein) level significantly high, TSH (thyroid-stimulating hormone) level normal at the upper limit. Total leucocyte count with lymphocytes count slightly high, eosinophil count are significantly high. So your back pain, tiredness, more sleepy feeling with inflammation of foot may result from vitamin D3 deficiency. Clinical features of vitamin D3 deficiency are repeated infections, tiredness, back pain, depression, bone pain, muscle pain, fatigue, delayed wound healing, feeling sleepy, etc. Again high TG levels may cause abdominal pain, loss of appetite, nausea or vomiting, tiredness, fatigue, etc. Your high eosinophil count indicates that you may suffer from allergies. As your TSH level is normal at a higher limit, so you should repeat the thyroid function test within three months. For your vitamin D3 deficiency, you should need more exposure to sunlight for vitamin D3 synthesis as well as take vitamin D3 enriched foods and supplements. For your high TG level, you should continue Fenofibrate along with Omega-3 fatty acid for low HDL level and repeat your lipid profile test after three months. For your low back pain, you can take Naproxen with Esmoprazole combination with Baclofen and calcium supplements.  ",
        "Patient":"Hello doctor, I have back pain, tiredness, more sleepy feeling, and inflammation on the foot."
    },
    {
        "id":495,
        "Description":"Q. What does abutment of the nerve root mean?",
        "Doctor":"Hi. I have gone through your query with diligence and would like you to know that I am here to help you. For further information consult a neurologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/neurologist  ",
        "Patient":"Hi doctor,I am just wondering what is abutting and abutment of the nerve root means in a back issue. Please explain. What treatment is required for annular bulging and tear?"
    },
    {
        "id":496,
        "Description":"Q. Will Nano-Leo give permanent solution for erection problem?",
        "Doctor":"Hi. For further doubts consult a sexologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist  ",
        "Patient":"Hello doctor, I am 48 years old. I am experiencing weak erection and difficulty in sustaining the same. This condition was observed 10 years back. Also, there is premature ejaculation. Other physical ailments that I have are, I am suffering from hypertension and taking Amlopres-L (Amlodipine and Lisinopril) for the last 10 years, high cholesterol and triglycerides. My cholesterol level is 225 and triglyceride is 200 for the last 12 years. I used to do frequent masturbation in early age. I do have erection during morning hours many times, particularly after sound sleep or if I had long walk previous day. I am having Sildenafil 25 mg or 5 mg Cialis, which is effective enough. But, I wish to get rid of tablet support and live natural way. I consulted urologist today and he prescribed me Nano-Leo capsules and Modula 5 mg for 10 days. I wish to have your second opinion on this. Please guide."
    },
    {
        "id":497,
        "Description":"Q. Every time I eat spicy food, I poop blood. Why?",
        "Doctor":"Hello. I have gone through your information and test reports (attachment removed to protect patient identity). So, in view of that, there are a couple of things that I can opine upon: Hope that helps. For more information consult a general surgeon online --> https:\/\/icliniq.com.\/ask-a-doctor-online\/general-surgeon  ",
        "Patient":"Hi doctor, I am a 26 year old male. I am 5 feet and 9 inches tall and weigh 255 pounds. When I eat spicy food, I poop blood. Sometimes when I have constipation as well, I poop a little bit of blood. I am really scared that I have colon cancer. I do have diarrhea often. I do not have a family history of colon cancer. I got blood tests done last night. Please find my reports attached."
    },
    {
        "id":498,
        "Description":"Q. Will Kalarchikai cure multiple ovarian cysts in PCOD?",
        "Doctor":"Hello. I just read your query. See Kalarachi Kai choornam is helpful in amenorrhea. As far as small cysts are concerned they are unmatured eggs which failed to induce menstrual cycle previously, as a result, they got collected in the ovary and they will remain in the ovary. Now, you have got your periods you can start trying for conception. But I advise you to do it under the supervision of a nearby gynecologist because egg size is important while conception and that you can know by ovulation study. Ovulation study is performed under the supervision of a gynecologist. For gall stones, surgical intervention is required generally. Medicine is not of much help.  ",
        "Patient":"Hello doctor, I have multiple small cysts in both ovaries (PCOS). Our family friend suggested me to consume Kalarchikai medicine, powdered mixed with pepper and honey to have it for one mandalam (48 days). I have completed nearly 44 days by consuming one small ball of the mixture every morning and before two weeks I got my periods. Then I had checked whether the cysts were dissolved by having an abdomen scan. But still, small multiple follicules have been seen in it with both ovaries enlarged. Kindly suggest me what I can do further. I got married before one and a half years and I am much worried about my pregnancy. I have gallstones as well."
    },
    {
        "id":499,
        "Description":"Q. I masturbate only by rubbing the tip of the penis. Is it a wrong way?",
        "Doctor":"Hi. For further doubts consult a sexologist online -->https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist   ",
        "Patient":"Hi doctor, During masturbation I just rub the tip of the penis and not the entire penis. Is it a wrong way of doing? I do not get excited during sex and unable to ejaculate. Only, rubbing the tip of the penis gives me excitement. Also, two weeks ago, I have undergone circumcision as my foreskin did not retract. Before circumcision too, I have the same problem. Please help."
    },
    {
        "id":500,
        "Description":"Q. I am just 21 years old but facing hair thinning problem. Will Finasteride help?",
        "Doctor":"Hi.  From the information given it seems you are experiencing the early signs of male pattern hair loss. This is a very common condition and there are many factors responsible, one of them being genetic. Due to the effect of the male hormone on the hair cycle, over a period of time the hair follicle starts shrinking and so the hair which comes out is thinner and more fragile and breaks easily. Also, the growing phase of the hair is shortened, so your hair does not grow as long it used to and becomes shorter and wispier. There are several treatment options available and the sooner we start the treatment the better the chances of reducing further hair loss\/thinning and increasing regrowth. A combination of oral supplements to boost hair growth along with the application of lotions containing Minoxidil 5% to begin with will be the best course of action in my opinion. Oral Finasteride, which is the male hormone blocker, is used frequently. Applications with Finasteride are available too. This will be prescribed by your treating doctor after assessing the extent of thinning and discussing the side effects, etc. Several preparations of biopeptides and other natural ingredients like saw palmetto extract, melatonin, etc are also available to boost hair growth. PRP (platelet-rich plasma) is a popular procedure that is often used in combination with medical treatment to stimulate hair growth further. Usually, a combination of treatments is suggested after the clinical evaluation. But using the applications regularly is the key to good results. Hair regrowth takes a few months to show and you will have to be patient to see the benefit of treatment. I hope this helps.  ",
        "Patient":"Hello doctor, I am a 21-year-old male. I have thinning hair and was planning of preventing through medication. I was planning on taking Finasteride."
    },
    {
        "id":501,
        "Description":"Q. I get infection in skin followed by ear and eye infection with whitish-yellow discharge. Please help.",
        "Doctor":"Hi. I can understand your concern. According to your statement you have been suffering from skin rash without itching, ear infection with swelling and discharge, eye infection with coming out of something whitish-yellow under eyelid, and mucus with the same particles. All these sufferings may happen due to parasitic infestation that is your assumption. I have gone through your case several times and I think that all your sufferings may result from any infection due to any cause or allergies.Your skin rash may develop from any kind of allergies like food allergy, drug reaction or allergy, dust, or mite allergy. Then you developed an ear infection which may be due to bacterial cause. After that, you may suffer from conjunctivitis which is easy to catch through touching. You may get conjunctivitis by touching your infected hand that had touched your ear. In conjunctivitis, whitish-yellow discharge may come out under eyelid. You can use an antibacterial drop on your affected ear and eye with antihistamine along with or without broad-spectrum antibiotics orally. But in the case of viral infection, these medications do not work. Wash your eye with water regularly and before touching any part of the body wash your hands with soap or sanitizer. I hope this helps.  ",
        "Patient":"Hello doctor, I have multiple conditions going on right now and fear that it could be a parasitic condition and need some expert advice. Started off with a terrible skin rash that has large and small lesions but no itch. Next a pretty substantial ear infection with swelling and discharge. Now the infection seems to be in my eye were small whitish-yellow things were coming out from under my eyelid from last evening. I have begun to inspect my mucus as it appears to have the same particles. I am very scared at this point and I appreciate anything you can offer."
    },
    {
        "id":502,
        "Description":"Q. I have depression with restless leg syndrome and dissociation. Please help.",
        "Doctor":"Hi. I have gone through your concern and it seems that you have an obsession and your restless leg can be due to iron deficiency or it may be due to Sertraline. So check out your hemoglobin, and complete blood count to rule out iron deficiency anemia. Restless leg can be managed by adding Pramipexole or Gabapentin tablet. You did not mention about the doses of Sertraline, if required its dose can be up or downed to manage depression. Avoid coffee or tea. Maintain a diary of your symptoms. Do regular exercise. Take a healthy diet. I hope this helps.  ",
        "Patient":"Hello doctor, I am a 19-year-old college student. I have been diagnosed with depression two years ago and I have been taking Sertraline ever since. My mental health is a mess right now. I think I have restless leg syndrome and I always have the urge to move my feet and legs especially when I am lying down. Also, I have been dissociating, every once in a while, real life feels like a dream and I sometimes cannot recognize my own face in the mirror. But here is what really bothers me, the intrusive thought of death that cannot leave me at all. I close my eyes and see horrible images and think about death and visualize my loved ones dying.  I have also been having recurring nightmares, almost daily, really disturbing, and often death. I also tend to worry a lot about my loved ones and always feel the need to check up on them. It became like an obsession and I fear losing control and losing stuff. I have a lot of doubt about my spiritual and religious life. In total, I am really anxious and distressed. I now have heavy heartache feeling and I tend to clench my jaws and fists. I also suffer from a restless sleep. Please help."
    },
    {
        "id":503,
        "Description":"Q. I have swollen lymph nodes on neck and tonsil with sore throat. Please help.",
        "Doctor":"Hi. I can understand your concern. According to your statement, you have been suffering from swelling of lymph nodes on the neck with swelling of tonsil and sore throat. You lead an erratic life. You are a smoker. You do not maintain your oral hygiene regularly. You also do not take your meal regularly. Your presenting clinical features can result from strep throat, peritonsillar abscess, tonsilloliths (tonsil stone), tonsillitis, Non-Hodgkin's lymphoma or carcinoma, etc. According to your picture that is provided here you may suffer from tonsil stone or peritonsillar abscess. In both cases, treatment are almost the same. You should take a broad-spectrum antibiotic for 7-10 days with gargle with salt mixed warm water, mouth wash, apple cider vinegar, and brush regularly. Usually tonsil stones dislodge themselves over time. If the clinical features such as difficulty in deglutition, difficulty in breathing, breathing difficulty during sleeping, pain radiating to ear, etc., occur consider as a medical emergency and consult with an ENT specialist for tonsillectomy. You should observe your lymph nodes carefully. Any sudden change in size or shape of lymph node, high fever, weight loss, night sweating, persistent fatigue, respiratory distress, etc., should be considered as alarming signs for carcinoma. So do not be worried. Take balanced food and maintain oral hygiene strictly.  ",
        "Patient":"Hello doctor, Recently (the last week at the most) my lymph nodes in my neck have been very swollen. When looking at the back of my throat, I can see small tonsil stones, small, but many. There is swelling which I am hoping is associated with the stones and there is a lot of swelling at the top of my right tonsil. The right side of my tonsil definitely is sore but fluctuates throughout the day. I have used tobacco, tobacco-products fairly consistently for the last two years, smoking at most a cigarette per day, and vaping. There are also flesh-colored bumps on the back of my mouth on the left side, they are not painful though. There is one on the top and one down by the tongue. I have not noticed these previously. My depression sometimes affects my hygiene, so I am hoping that this could be the cause of the stones. I have been brushing twice a day, flossing, gargling with salt water, and mouth wash. Since doing this, I have noticed much less swelling in my lymph nodes and a little less in my tonsils. My diet also has not been the healthiest lately (eating about one meal a day) and my sleep schedule has been a wreck. I am just really hoping it is not cancer but I have yet to go see a doctor."
    },
    {
        "id":504,
        "Description":"Q. After meningitis vaccination, I am getting headache with visual aura and dreamy sleep. Please help.",
        "Doctor":"Hello. Your symptoms seem to be related to tension type headache, which is a benign headache. Light and sound intolerance are features of migraine, but the other symptoms you explain, are more compatible with tension type headache. Nevertheless, I agree with your doctor treatment regarding Escitalopram. You should know that the sleep disorders are related to different causes depression, daily stress and anxiety, vitamin D deficiency, an abnormal sleep regime, caffeine intake, etc. I would recommend taking Vitamin D if there is low plasma levels of this vitamin. Regarding your sleep disorder, I would recommend starting Zolpidem for a couple of weeks 10 mg before sleep. You can try half a tablet before going to 10 mg. Melatonine intake can regulate your sleep rhythms too, but it is taken for a more prolonged time than Zolpidem and its effects are lower. A good sleeping hygiene (sleep always at the same time, avoid straining physical or emotional activities before sleep, avoid caffeine intake) would help too. If all these tips and drugs are not helpful, a prolonged brain EEG (electroencephalogram) during sleep would help diagnose any possible sleeping disorders. Regarding Flunarizine, I would explain that this is a calcium channel blocker and as such it can interact with calcium or vitamin D in high amounts. But usually it does not affect the calcium levels. You can try taking Escitalopram for three months initially and then try Flunarizine, if no good results on Escitalopram. I would not recommend taking them both initially. You should know that Escitalopram achieves its effect after three weeks from the starting, and the main changes to be seen are a reduce in the frequency of headaches and also mood changes (optimism). You can try taking Amitriptyline too, if you do not have any symptoms relief after the first month on Escitalopram. It can be really helpful with the sleep too. All the drugs have some adverse effects, but the benefits are higher. I hope this helps.  ",
        "Patient":"Hello doctor, I have taken meningitis vaccination for visa process. I suffered headache with visual aura with dreamy sleep and less sleep for three months. I started treatment in India and took Cipralex, and Escitalopram. CT scan was normal. My symptoms relieved for about 80-90%. I gradually tapered off the treatment. Later, mild dreamy sleep problem with mild and sound sensitivity occurs. I did not took any medicine for that. I also suffered from scalp pain in head and treated for three months with Phenergan, and Neocalm plus. I felt only temporary relief. MRI was done in consultation with neurologist. Results are normal. I was on Cipralex 10 mg, Naproxen sodium 250 mg then gradually tapered. After that I am suffering from dreamy sleep all day and localized head pain episodes 2-3 times in a week when sleep disturbed in the previous night. Meanwhile, I was heavily stressed due to family issues and job pressure. Once again I was prescribed the same medicines but I did not take and tried to control it with yoga and meditation. I have mild light and sound sensitivity which is quite tolerable. My major problem is disturbed dreamy sleep and episodes of localized head pain in the scalp only. I took vitamin D, B12, calcium for six months. My elevated triglycerides are due to SSRI 230 mg\/dl. At present, I am alright but want to get rid of symptoms. My symptoms are muscle tension and nerve pain. I did eyes test OCT and my eyes are normal. My questions are even if I am not stressed I do not get dreamless and refreshing sleep why? Which is suitable medicine in general? Can Flunarizine cause more deficiency of calcium as already I am deficient? Cipralex and Esclitopram are habit forming but I was very comfortable with that it causes weight gain and elevation of triglycerides so I tapered off to end. But after some time dreamy sleep and scalp mild pain comes back. What to do? Kindly suggest and advise some medicines."
    },
    {
        "id":505,
        "Description":"Q. I feel like something is stuck in my chest, and I have acidity. What to do?",
        "Doctor":"Hello. I welcome you to icliniq. Well it seems you have gastroesophageal reflux GERD. You acid symptoms can be defined by presence of GERD. I hope this will help you Come back to discuss if any more concern you have good day GERD Nothing for now Motility disorders NERD GERD as above Follow up in 1 week to inform how you respond to treatment  ",
        "Patient":"For the last one month i am having gastic issue as i feel that some thing got stucking in my chest or stomach and have acidic feeling in throat more over constant air get passes through my mouth but nothing relaxation at all. Got heavy chest pain on left side during the period. My digestion process also get disturb as stool didnot come properly"
    },
    {
        "id":506,
        "Description":"Q. I worry that social anxiety will be a hindrance to achieving my dreams. Please help.",
        "Doctor":"Hello. Thank you for your query This is very common and about 10-15 percent of people have this problem. It is also very easily treatable. You will need to visit a psychiatrist and he will prescribe you SSRI type of medicines (such as escitalopram 10mg, or fluoxetine 20mg etc.) which will help with your problem. It basically happens when some neurotransmitters such as serotonin reduce in your brain leading to a problem with handling the day to day stresses of life. Medicines are usually given for 2-4 months and then tapered off slowly and stopped. In addition to the medicines, you can also undergo a few sessions of cognitive behavioral therapy from a clinical psychologist. Also do consider doing deep breathing exercises or progressive muscle relaxation daily. T. Escitalopram 10mg once at night for 30 days  ",
        "Patient":"Hi doctor, I searched the symptoms of social anxiety online and I think I have it. I am a student and it has been affecting my daily life, especially my school life. I struggle to have new friends and do tasks that require social interaction like class presentations. I tried changing my behavior, tried making new friends, talk to people but it only ended up in vain. I thought that if I can't change myself now, what about the future? I worry that social anxiety will be a hindrance of achieving my dreams. If I'm not going to be successful in life, I might as well end this now to not be a burden to the people around me. But I hope that that's not the only solution, doc. Please help me."
    },
    {
        "id":507,
        "Description":"Q. My wife has Raynaud's with pale violet and gangrene fingers. Please help.",
        "Doctor":"Hello. You are right in saying that she has the symptoms of Raynaud's with digital gangrene which is on going. With arthritis, there are 50 variants of it and it is very important to distinguish which one she has it as the management will differ for every arthritis. I would like to ask a few more queries: Any history of oral ulcers? Hairfall? Any history of fever? Which joints are affected? Swelling in the joints? Any deformity? Any changes in skin color or skin becoming tightened? Any history of dry eyes or dry mouth? Any muscle weakness which you have observed? With the start of Raynaud's, it seems like a systemic involvement more, something like lupus, but we need to rule it out. Kindly let me know these queries and I am advising a few tests. If they have been done, please attach the reports as well. CBC (complete blood count). ESR (erythrocyte sedimentation rate). CRP (C-reactive protein). Rheumatoid factor. Anti CCP antibody. A NA(by immunofloroscence). Serum creatinine. Urine routine. Connective tissue disease.  ",
        "Patient":"Hello doctor, My wife has arthritis and has become very weak over the last few months. Now she has a condition that is more or less like Raynaud's phenomenon. Her fingers are turning pale violet and one of the fingers had gangrene like occurrence. Not only hands but even the toes are experiencing the same. Please help."
    },
    {
        "id":508,
        "Description":"Q. I am having weak erections due to masturbation with prominent veins on penis. Please help.",
        "Doctor":"Hi. According to your history, it looks like you have psychogenic erectile dysfunction. Stopping masturbation would not help. The best would be to start a short course of medicines and take cognitive behavioral therapy to reduce the anxiety which has caused this problem. The vein in the picture looks absolutely normal (attachment removed to protect patient identity) and it is in fact a sign of a healthy penis. Remember it is temporary and most men face this issue sometimes. Maintain a healthy lifestyle and sleep for seven to eight hours at a stretch. Use Lavender aroma in your house which helps reduce your anxiety.  ",
        "Patient":"Hi doctor, I am 25 years old. I am having weak erections for two months. I think it is because of more masturbation so I stopped doing it since 35 days, but still, I am not having erections. I am also having a prominent vein on the top and either side of the penis even when flaccid. I do not smoke or drink. I exercise regularly. I am worried now please help."
    },
    {
        "id":509,
        "Description":"Q. I have tinnitus and it does not subside on antibiotics. Why?",
        "Doctor":"Hi. The answer to your question entirely depends on how you developed the ear infection in the first place. In general, until the eardrum heals you will be having weird noises, tinnitus, and ear discomfort due to interference with sound transmission and processing. If the ear infection has happened secondary to recurrent allergy or cold, then you will have probably developed a eustachian tube catarrh due to which the fluid is still present in the middle ear causing the tinnitus and will take around two months approximately in toto for tinnitus to resolve. If the ear infection has occurred due to trauma (by earbuds etc), the tinnitus will take approximately four to six weeks, as this the average time it takes to heal the ear drum. I am sure you fall into one of the two possibilities mentioned above. There is absolutely nothing that you need to worry about as this usually takes a while for things to normalize. At the same time make sure there are no triggering factors out there. Some one they include use of earphones, headphones, exposure to loud sounds, consumption of alcohol, smoking, stress, etc. Try to maintain a healthy lifestyle as much as possible and do not think too much about the tinnitus nor try to Google about it too much. I hope this helps.  ",
        "Patient":"Hello doctor, I have an ear infection on my right ear for the past one week. So my doctor prescribes me some antibiotics Amoxicillin with Prednisolone. But my tinnitus did not go away. How long will it take for the tinnitus to go away if there is no pain in my ear?"
    },
    {
        "id":510,
        "Description":"Q. What does abutment of the nerve root mean?",
        "Doctor":"Hi. I have gone through your query with diligence and would like you to know that I am here to help you. For further information consult a neurologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/neurologist  ",
        "Patient":"Hi doctor,I am just wondering what is abutting and abutment of the nerve root means in a back issue. Please explain. What treatment is required for annular bulging and tear?"
    },
    {
        "id":511,
        "Description":"Q. Will Nano-Leo give permanent solution for erection problem?",
        "Doctor":"Hi. For further doubts consult a sexologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist  ",
        "Patient":"Hello doctor, I am 48 years old. I am experiencing weak erection and difficulty in sustaining the same. This condition was observed 10 years back. Also, there is premature ejaculation. Other physical ailments that I have are, I am suffering from hypertension and taking Amlopres-L (Amlodipine and Lisinopril) for the last 10 years, high cholesterol and triglycerides. My cholesterol level is 225 and triglyceride is 200 for the last 12 years. I used to do frequent masturbation in early age. I do have erection during morning hours many times, particularly after sound sleep or if I had long walk previous day. I am having Sildenafil 25 mg or 5 mg Cialis, which is effective enough. But, I wish to get rid of tablet support and live natural way. I consulted urologist today and he prescribed me Nano-Leo capsules and Modula 5 mg for 10 days. I wish to have your second opinion on this. Please guide."
    },
    {
        "id":512,
        "Description":"Q. Every time I eat spicy food, I poop blood. Why?",
        "Doctor":"Hello. I have gone through your information and test reports (attachment removed to protect patient identity). So, in view of that, there are a couple of things that I can opine upon: Hope that helps. For more information consult a general surgeon online --> https:\/\/icliniq.com.\/ask-a-doctor-online\/general-surgeon  ",
        "Patient":"Hi doctor, I am a 26 year old male. I am 5 feet and 9 inches tall and weigh 255 pounds. When I eat spicy food, I poop blood. Sometimes when I have constipation as well, I poop a little bit of blood. I am really scared that I have colon cancer. I do have diarrhea often. I do not have a family history of colon cancer. I got blood tests done last night. Please find my reports attached."
    },
    {
        "id":513,
        "Description":"Q. Will Kalarchikai cure multiple ovarian cysts in PCOD?",
        "Doctor":"Hello. I just read your query. See Kalarachi Kai choornam is helpful in amenorrhea. As far as small cysts are concerned they are unmatured eggs which failed to induce menstrual cycle previously, as a result, they got collected in the ovary and they will remain in the ovary. Now, you have got your periods you can start trying for conception. But I advise you to do it under the supervision of a nearby gynecologist because egg size is important while conception and that you can know by ovulation study. Ovulation study is performed under the supervision of a gynecologist. For gall stones, surgical intervention is required generally. Medicine is not of much help.  ",
        "Patient":"Hello doctor, I have multiple small cysts in both ovaries (PCOS). Our family friend suggested me to consume Kalarchikai medicine, powdered mixed with pepper and honey to have it for one mandalam (48 days). I have completed nearly 44 days by consuming one small ball of the mixture every morning and before two weeks I got my periods. Then I had checked whether the cysts were dissolved by having an abdomen scan. But still, small multiple follicules have been seen in it with both ovaries enlarged. Kindly suggest me what I can do further. I got married before one and a half years and I am much worried about my pregnancy. I have gallstones as well."
    },
    {
        "id":514,
        "Description":"Q. I masturbate only by rubbing the tip of the penis. Is it a wrong way?",
        "Doctor":"Hi. For further doubts consult a sexologist online -->https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist   ",
        "Patient":"Hi doctor, During masturbation I just rub the tip of the penis and not the entire penis. Is it a wrong way of doing? I do not get excited during sex and unable to ejaculate. Only, rubbing the tip of the penis gives me excitement. Also, two weeks ago, I have undergone circumcision as my foreskin did not retract. Before circumcision too, I have the same problem. Please help."
    },
    {
        "id":515,
        "Description":"Q. Please suggest ways to prevent the symptoms of piles from recurring.",
        "Doctor":"",
        "Patient":"I m having prblm of piles (without any lump) only mild bleeding at the the time of defecation which is seen on the toilet paper only while wiping ...there is no bleeding seen in the stool...sometimes constipation is there ...but motions r not hard ...facing this prblm from last 6 months i mean it happens 3 to 4 times in last 6 months ..sharp pain only at the time of defecation after that no pain....but the prblm is that it reoccurs in 1-2 months... rgt now i m taking arshkalp vati one tablet twice in a day and abhyarishta..... along with amla juice in the mrng empty stomach from last 20 days and feeling relief no pain ...no bleeding after one day of taking these medicines but i m afraid it comes back when i stop taking them ...r these medicines safe for long term use????How much time does it take to get rid of this prblm from these ayurvedic medicines? And the duration of these medicines plz guide?"
    },
    {
        "id":516,
        "Description":"Q. I have itchy and dark rashes in my inner thighs. Please help.",
        "Doctor":"Hi. It seems the rash and itching on the inner thighs could probably be due to a fungal infection of the skin. This is very common especially in tropical countries and more so in the hot humid summers. To accurately diagnose the same, further information like images of the affected area, total duration of the rash, any other areas affected, any discoloration of nails, etc., are needed. If it is indeed a fungal infection the following can be kept in mind. Treatment of fungal infections includes applications which contain Ketoconazole, Sertaconazole, Luliconazole, etc. Oral antifungals like Terbinafine and Itraconazole are often used in combination for better clearance and reducing recurrences. Local hygiene is very important. Taking bath daily, drying the skin folds after bath, keeping soap and towels separate and drying your clothes in sunlight and ironing them before wearing will help to kill the fungal spores. So, I will recommend evaluation by a dermatologist to decide on the treatment. I hope this helps.  ",
        "Patient":"Hello doctor, I have rashes on my inner thighs. They are itchy and have infected areas of dark color. There is no pus but just itchiness."
    },
    {
        "id":517,
        "Description":"Q. My pulse rate is 50 to 58 at rest. Should I be worried?",
        "Doctor":"Hello. This resting pulse is perfectly normal in healthy peoples. This pulse will rise once you exert. Rise in heart rate with exercise and fall during rest is a normal phenomenon that is controlled by our autonomic nervous system. In healthy persons, it even falls in 40s during sleep. So, nothing to worry. The only thing that I would like to ask you is whether you have any symptoms such as dizziness during low pulse rate? Another thing is ECG (electrocardiogram). I want to see your ECG to see whether it is a sinus rhythm or is there any block. As your cardiac workup is done and is normal, I do not think you need any more work up but if there are occasional symptoms associated with low pulse rate as graying of vision, dizziness, etc, I would advise you to have a Holter monitoring done for 24 to 48 hours to see rise and fall of heart rate during daily activities including sleep. If you have no symptoms, just relax and do not worry.  ",
        "Patient":"Hello doctor, I have been having consistently a very low resting pulse, between 50 and 58 and I do not know if this is a sign of a problem. I do not have any other issues besides nausea sometimes. I am 39 years old and overweight (BMI 32.9). Should I be worried?"
    },
    {
        "id":518,
        "Description":"Q. My precum is four times excess than the normal. Is there any medication to reduce it?",
        "Doctor":"Hi,  Welcome to icliniq.com. Precum is the fluid coming naturally out before ejaculation, its function mainly is to lubricate during intercourse. It man contain sperms as well. This fluid comes naturally and it is good for us actually. And the amount will vary with age and sexual desire. There are medications to reduce it but I do not advise you to take it as those medications are also reducing sexual drive. Other way if it really disturbs you during sexual intercourse then you can masturbate before intercourse. To remind you this precum can contain sperms so if you intend for pregnancy then you have to do protected intercourse. I hope this helps.  ",
        "Patient":"Hello doctor, I am a 35-year-old male. I am concerned about the amount of precum when aroused. From my understanding, a teaspoon full would be normal. I have probably four times more. It is disturbing and I would like to reduce it via medication."
    },
    {
        "id":519,
        "Description":"Q. I have seronegative arthritis with unbearable joint pain in the night. Please help.",
        "Doctor":"Hello. I have gone through your reports and history (attachment removed to protect patient identity). There seems to be some inflammation going on in the blood reports and with a diagnosis of previous arthritis, it looks like it is coming back again. Does rheumatologist did not want to start on Methotrexate or any other DMARD? Are you not on any medications for the CA prostate? Any other symptoms of oral ulcers, dry eyes, or dry mouth? Do let me know these queries and I would advise you further.  ",
        "Patient":"Hello doctor, I have seronegative inflammatory arthritis with ana positive. Joint pain especially at right knee shoulder joints MTP IP joints. Unbearable in the night for the last three months relieved with NSAID (non-steroidal anti-inflammatory drugs) patient cannot walk chairbound with in situ catheters for more than four years.  I am taking Ultracet if pain unbearable, few days back I have taken Injection Kenacort 60 mg IM on the advice of rheumatologist with some relief, but again pain resurfaced. Apart from that patient is on Apixaben 2.5 daily, Mirabeg 50, Soliton 20 and Donezepil 5, Vitamin C 1 gm daily. No BP, and DM issue. I am taking inhaler Laba with corticosteroid for long."
    },
    {
        "id":520,
        "Description":"Q. Will hiatal hernia problem stay forever?",
        "Doctor":"Hello. I can very well understand your concern and at the start, I want to tell you that chronic straining does not lead to the development of hiatus hernia, however, your weight can. Hiatus hernia is an anatomical change that can present since birth, and after certain surgical procedures over abdomen or diaphragm, overweight to obese can develop hiatus hernia because of the excessive pressure over the stomach from belly fat, causing upward lifting of the lower part of food pipe and formation of hernia. And lastly, due to the old age when the diaphragmatic muscle gets weakened allowing part of the lower esophagus to get pulled in the lower part of the chest. In a young healthy people, diaphragmatic muscle is strong enough to prevent this from happening. Valsalva maneuver if performed vigorously can cause tears in the lower part of the esophagus which is an acute complication of this, but it will not alter the anatomy or produce a hiatus hernia. Valsalva can harm somebody if it is done without a reason (there are certain indications for medical conditions), but it can only cause damage to the lower part of the esophagus acutely but would not alter the anatomy of it i.e. hiatus hernia. Yes, an x-ray plain without contrast can easily miss a hiatus hernia. A special x-ray with contrast named barium is swallowed, and serial x-ray images from the chest are taken, that can diagnose the hiatus hernia instantly, however, a plain chest x-ray cannot detect the presence of hiatus hernia. So now coming to your second concern that you have to live with it. Well, it is not yet proven that you have a hiatus hernia, secondly, it is not uncommon to have hiatus hernia in people without any symptoms and it can remain undiagnosed until their whole life. The point is it can present harmlessly in human for years and years and does not necessitate any investigations. The time to develop a hiatus hernia is variable but it does take many years of overweight to cause hiatus hernia (very less likely within 6 to 12 months time). It is not a rule that every hiatus hernia would cause symptoms or disease or any complications. I would not suggest you even to worry about it and get tested for it. Because it would not change anything for you. Simple exercises, keeping a healthy lifestyle, reduce weight are all that is required. The weight loss is very compulsory, this will not only help you preventing hiatus hernia but also other things like gastroesophageal reflux (GERD), bloating, gas distention, constipation. I hope this helps. Overweight. Barium swallow if worried about it, or have symptoms suggestive of gastroesophageal reflux. Weight reduction. Follow up to discuss if any concern.  ",
        "Patient":"Hello doctor, I am a 31-year-old male who until recently weighed about 100 kg. For the last six months to a year, I was obsessively performing a Valsalva maneuver because I had health anxiety and OCD and I was worried about an operation. When I was younger I could have impacted my continence. I have been having some GI issues lately and read that you can cause a hiatal hernia from chronic straining. Is it possible that I could have caused a hiatal hernia at my age? Are six months to a year chronic enough? If I have caused a hiatal hernia will it stay forever? Or can I reduce it and the hernia size through exercise to tone and strengthen the diaphragm and weight loss? I am extremely worried I have caused a hernia and will have to live with it forever. I have had a standard x-ray of the chest which came back normal. Could a hernia have been missed?"
    },
    {
        "id":521,
        "Description":"Q. I have problem while initiating urine with erectile dysfunction. Please help.",
        "Doctor":"Hello. One thing you have not tried yet is tablet Alfuzosin 10 mg for two weeks. You can try this, I think your flow will become better.  ",
        "Patient":"Hello doctor, I have a 30 -year-old male. I am 5 feet and 11 inches with 75 kg weight. I had difficulty initiating urination and also had a case of erectile dysfunction. The problem with starting urination was many years ago, which I ignored because I thought it would go away normally. I only recently found out about my ED (a few months ago). I have no problem while masturbating. After visiting a urologist, they asked me to take several tests (reports attached below). The report showed that I had a case of chronic prostatitis with a bacterial infection. I was asked to take medication for two weeks (antibiotics) and then supplements for three months. I have taken the antibiotics for another two weeks. I have not been able to go for another checkup due to lockdown. I took Jippo (Azithromycin), and Pantop (Pantoprazole). Supplements I took Revital Care, Neuro Care, Caldoz, Lovaza, and Cholecalciferol capsules (DV 60K). The doctor also suggested me to exercise, maintain nutritious diet and take vitamins for the ED. I have taken two doses of EDSave 10 mg tablets for two weeks. This helps with strong erections. I still feel that the medication has not fully worked because I need to wait for some time to start urinating. I have attached all my reports."
    },
    {
        "id":522,
        "Description":"Q. I am diabetic and have cold toes and feet with sweating. Why do I get this?",
        "Doctor":"Hi. HbA1c (Glycated hemoglobin) is still on the higher side. It should be below 6 to be normal. Do regular testing of FBS (fasting blood sugar), PPBS (postprandial blood sugar) to monitor the blood sugar levels. Coldness in feet can be due to less blood supply to feet that can happen in case of any clot in blood vessels. Peripheral neuropathy is also common in diabetes which can lead to less sensation in feet. I would suggest you undergo color Doppler leg to rule out any clot. Tablet Gabapentin once daily you can start along with previous medicines.   ",
        "Patient":"Hello doctor, I am 66 years, 175 cm, 72 kg. I have diabetes from 2009 and hypothyroid from 2011. I am taking Janumet (50\/500) BD and Thyronorm (75) OD. My blood sugar is 105 - 111, HbA1C 6.7. TSH is1.93 and Hb is 11.9. My lipid profile is normal. Serum creatinine is 1.16. My diabetes has been under control by medicines since inception. My BP is 125\/82 mmHg. Temperature is 98.0 F. Sometime I feel cold in my toes, even when my feet are sweating. Can you suggest some remedies?"
    },
    {
        "id":523,
        "Description":"Q. I have some circular itchy bumps on my left buttock. Please suggest medication.",
        "Doctor":"Hi. I can understand your concern. According to your statement, you have been suffering from red-colored circular bumps on your left buttock which are very itchy and sore. According to the pictures that are provided here (attachment removed to protect patient identity), I think you are suffering from folliculitis. They are developed when hair follicles become infected due to bacterial infections like staphylococcus aureus or friction or shaving. They may be caused by viral or yeast infections too. Initially, folliculitis may look like rashes, a patch of small red bumps that are very itchy with sore and form whiteheads. Overtime, they can spread and progress to crusty sores. You can take Flucloxacillin 500 mg four times daily for 10 days by applying antibacterial cream on your affected area along with your current medications. You can apply topical steroid cream too. Wash your affected area daily with antibacterial soap and wear loose clothing along with maintaining personal hygiene.  ",
        "Patient":"Hello doctor, I need help regarding with some circle bump appearing on my left buttocks, it is so very itchy and sore. I just bought antifungal cream and antifungal soap over the counter but I still want to know what really is this appearing on my buttocks. I did take some pictures of it, so I can send it over here. Please give me prescription of what medicines needs to make it disappear and heal."
    },
    {
        "id":524,
        "Description":"Q. I have redness on the penis foreskin with burning sensation. Please help.",
        "Doctor":"Hi. If possible provide me photographs of the affected areas which will help me for a better understanding of your skin problem and proper treatment plan.  ",
        "Patient":"Hello doctor, I am a male 43-year-old. I have redness on the inside of the penis foreskin and burning sensation on a small part of the penis prepuce. I had a similar condition about four years back and consulted a skin specialist and got cured. I was recommended some medicine and Pyrimon eye drops for the problem. Again, I think a similar condition. I want to consult for treatment. Of late, I see some redness remains at a particular spot on the inside of the penis foreskin."
    },
    {
        "id":525,
        "Description":"Q. What does abutment of the nerve root mean?",
        "Doctor":"Hi. I have gone through your query with diligence and would like you to know that I am here to help you. For further information consult a neurologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/neurologist  ",
        "Patient":"Hi doctor,I am just wondering what is abutting and abutment of the nerve root means in a back issue. Please explain. What treatment is required for annular bulging and tear?"
    },
    {
        "id":526,
        "Description":"Q. Will Nano-Leo give permanent solution for erection problem?",
        "Doctor":"Hi. For further doubts consult a sexologist online --> https:\/\/www.icliniq.com\/ask-a-doctor-online\/sexologist  ",
        "Patient":"Hello doctor, I am 48 years old. I am experiencing weak erection and difficulty in sustaining the same. This condition was observed 10 years back. Also, there is premature ejaculation. Other physical ailments that I have are, I am suffering from hypertension and taking Amlopres-L (Amlodipine and Lisinopril) for the last 10 years, high cholesterol and triglycerides. My cholesterol level is 225 and triglyceride is 200 for the last 12 years. I used to do frequent masturbation in early age. I do have erection during morning hours many times, particularly after sound sleep or if I had long walk previous day. I am having Sildenafil 25 mg or 5 mg Cialis, which is effective enough. But, I wish to get rid of tablet support and live natural way. I consulted urologist today and he prescribed me Nano-Leo capsules and Modula 5 mg for 10 days. I wish to have your second opinion on this. Please guide."
    },
    
    {
        "id":257468,
        "Description":"Excessive tiredness, depression, body aches since receiving the depo provera shot. Could this be due to medicine or something else?",
        "Doctor":"Don't worry abt card, you need advice at this time. Following taking these pills, it is not mandatory to have symptoms like pain\/vomiting. If there is any vomiting within 1 hr of taking the pill, then repeat dose may be needed as drug may not work.   Is the date of 20th Sept correct or is it typo error? If it is really 20th Sept -- then you need to see gynecologist.  If it is 20th Oct- you need to wait for your next period. If the period is missed, immediately see the doctor. ",
        "Patient":"i had unprotected sex on 20th sep, n after 5hrs i took unwanted 72 bt up till now ie.9hrs after taking that pill my body did not show any kind of effect, no pain no vomiting , noting..nw m not sure that i took medicine or it splits out from my mouth at that tym..do i need to be worried or should i take the another pill? and one more thing doctor, i have no card from which i can pay ur fees :(.. is it necessary to pay or u can answer me like that... please let me know this"
    }
]